{"text": "Weekly YouTube/Blog/Self-Promo Round-up! Week of March 22nd, 2021"}
{"text": "I am in my 30’s and only now discovered the joy of roasting vegetables. I have been MISSING OUT."}
{"text": "Egyptian falafel are made with fava beans, which makes tastier, crispier and lighter falafel than chickpeas. They've won many awards and are pretty easy to make at home. Full recipe inside and I'll also teach you about stuffed falafel"}
{"text": "Fantastic breakfast calorie saver! How did I never do this before?"}
{"text": "Chimichurri - My new favorite sauce I put on everything"}
{"text": "Gyuvetsch: the hearty earthenware stew you didn't know you wanted"}
{"text": "Vegan-friendly mushroom ragu that is bursting with flavor and texture"}
{"text": "first time cooking, EVER. made a breakfast mix bowl thing"}
{"text": "Kimchi Pork Stew Recipe - Oriental / Korean cuisine to be specific"}
{"text": "Do you want help when you're in the kitchen?"}
{"text": "Wanted to share my awesome granola recipe!"}
{"text": "Secret Weapon Sauces:"}
{"text": "Question about spicy chicken sandwiches"}
{"text": "A Mushroom to Sway the Mushroom Haters"}
{"text": "What would create (wonderful) aroma and taste for ham pot pie? Celery salt?"}
{"text": "Do you cook different things every day?"}
{"text": "What can I cook (as a side) with broccoli and carrots"}
{"text": "one pot indian meals"}
{"text": "GREAT JONES COOKWARE?"}
{"text": "Air fryer ideas"}
{"text": "What's a 'new' spice you tried recently and can't get enough of? Please share recipes or tips on how to start using it. :)"}
{"text": "Sandwich filling recommendations"}
{"text": "Countertop Convection Oven Accessories"}
{"text": "Food recommendations after teeth removal?"}
{"text": "So now my kids are stuck eating aldi frozen pizza and I'm choosing to have a glass of wine for dinner..."}
{"text": "Veggie \"noodle\" scampi is close, but not quite there yet"}
{"text": "cutting board and oil"}
{"text": "pani puri recipe hyderabadi style | gupchup -2 stuffings"}
{"text": "Battering foods and freezing before deep frying"}
{"text": "The Great Courses: The Everyday Gourmet: Rediscovering the Lost Art of Cooking (Chef Bill Briwa)"}
{"text": "10 Items to Cook with TOTAL What would they be?"}
{"text": "Question to all - which kinds of lids are better?"}
{"text": "Recipes for a mini-oven"}
{"text": "I just accidentally made mac and cheese with cinnamon instead of black pepper. That's all."}
{"text": "Onigirazu, the practical questions"}
{"text": "The best scallion/chive substitute ever"}
{"text": "What the heck do I do with 2kg of beef?"}
{"text": "What To Do With 1.5 Gallons Of Frozen Boba"}
{"text": "I am not an experienced cook. Nor am I a great cook. But I'm also not a scared cook, and I'm attempting something completely made up on the spot for my wife when she gets home from work."}
{"text": "What's your advice to someone who wants to \"cook all the dishes!\" to slow down a bit"}
{"text": "pescatarian newcomer!"}
{"text": "What seasonings and spices do you consider a must have?"}
{"text": "I’m an idiot"}
{"text": "If there’s any appliance that would benefit best from a camera in it, it’s not my fridge. It’s my oven!"}
{"text": "From Brazil, looking to debating some ideas of mine"}
{"text": "Knives - And Taking Care Of It"}
{"text": "This sub is amazing!"}
{"text": "Lemon curd questions"}
{"text": "Preserving mother sauces"}
{"text": "Sauce for Mushroom/Sausage Ravioli?"}
{"text": "What's the deal with \"golden breadcrumbs\"?"}
{"text": "Chili powder."}
{"text": "How to cook Chuck Tender steaks"}
{"text": "I want to try and make pastry with pizza dough , should I use parchment paper or put it on the sheet directly for better crust on the bottom ?"}
{"text": "Can I make kenji’s foolproof pan pizza with gluten free flour?"}
{"text": "Avocado...."}
{"text": "Help with cooking Adana Kebab over charcoals"}
{"text": "Air fryer or toaster oven?"}
{"text": "Help I want to work as a cook"}
{"text": "How To Toast Sandwiches Like Quiznos? (Not grill, toast)"}
{"text": "Taco Bell nacho fries RECIPE!?"}
{"text": "What is the lightest oil for frying?"}
{"text": "What to make with dried sardines"}
{"text": "How the heck do you bread things quickly and efficiently? In need of technique advice."}
{"text": "What happened to Sir Kensington’s mayo?"}
{"text": "healthiest oil for baking"}
{"text": "Something is wrong with my parchment paper?"}
{"text": "What’s an extra topping to put on carbonara"}
{"text": "Side dish ideas for sloppy joes?"}
{"text": "Why are dried chillis always so bitter?"}
{"text": "Pizza sauce from fresh tomatoes"}
{"text": "Vegetarian substitute for anchovies"}
{"text": "Allergic to Apiaceae family spices (cumin, coriander, fennel, etc.). Looking for creative substitutes"}
{"text": "What Type of Fish Would Go With Cauliflower Rice?"}
{"text": "Does anyone have a home/countertop soft serve machine that actually works? help a pregnant lady out!"}
{"text": "Reddit, what separates a bad cook from a good cook? What separates a good cook from a great cook?"}
{"text": "Anyone make their own chili powder?"}
{"text": "Homemade bean and veggie soup was a hit"}
{"text": "Any other decent store-bought stock brands besides kitchen basics?"}
{"text": "What’s the nicest way to cook chicken breast?"}
{"text": "Affordable Vanilla Bean"}
{"text": "chicken Breast little pink outside, but fully cooked inside"}
{"text": "Cooking Outdoors"}
{"text": "Asking for help from someone who knows middle eastern / iraqi cuisine"}
{"text": "How do you get rid of brown rice chaff prior to cooking?"}
{"text": "The magic ingredient is tapioca flour! (Also known as tapioca starch)"}
{"text": "How to get firm &amp; crumbly cheesecake?"}
{"text": "My green onions have started to flower"}
{"text": "Pulled pork in the oven?"}
{"text": "Has anyone else tried Misfits Market?"}
{"text": "What do you guys think of this article - \"Have Sad Desk Lunches Gotten Sadder?\""}
{"text": "Rock-hard brownies (w/ Junior Mints) stuck in pan?"}
{"text": "Groceries delivered and sat in 65 f degree weather for exactly 2 house (during rain)"}
{"text": "Pro tip: make sure you read your spice labels. I just put four tablespoons of cayenne pepper in my chili instead of chili powder 🔥🥵"}
{"text": "How does lodge pre season their carbon steel skillets?"}
{"text": "I want to make garlic bread...but I am out of garlic powder!"}
{"text": "Slow cooking brisket question"}
{"text": "Quick question"}
{"text": "What’s a spinach recipe (international spinach day tomorrow), to feed an office that isn’t boring ass spinach dip?"}
{"text": "Learning to cook for my partner who has severe IBS. Cannot eat onions, tomatoes, mushrooms or anything in their families and I love to cook from scratch, but everything I knew as basic skills cant apply!"}
{"text": "Curing a ham"}
{"text": "Cooking marinaded chicken"}
{"text": "Favorite campfire cooking meals request."}
{"text": "Why do you add potatoes to cold water with salt as the first step for mashed?"}
{"text": "Goat Roast ideas"}
{"text": "What to add to a Moroccan dish to lighten up the taste?"}
{"text": "What took you way to long to realize? Me: Finishing dishes in the oven is amazing"}
{"text": "Eggs Benedict is basically an open-faced Egg McMuffin with warm mayonnaise instead of cheese. What other foods can you class up by swapping/adding one ingredient?"}
{"text": "Stew Troubleshooting"}
{"text": "Does butter go well with coconut milk in soups?"}
{"text": "Has anyone ever had cheesy chicken over rice in their schools?"}
{"text": "When roasting carrots in oven how do you prevent edges getting burnt?"}
{"text": "Everyone loves talking about their favourite dishes, but what's your cooking low point? My friend just reminded me of the time I made Kraft dinner with chocolate milk."}
{"text": "Empanada recipes"}
{"text": "help needed"}
{"text": "Question about how to cook shrimp to make it tender and “transparent” 🍤"}
{"text": "Italian recipes without onion or garlic"}
{"text": "Portable gas (Butane) burner question"}
{"text": "Flavour systems: salt, fat, acid, heat or 3s?"}
{"text": "Can someone ELI5 extra virgin olive oil and smoke points?"}
{"text": "Funny but yummy big meal ideas for April fools"}
{"text": "I'm Super Happy Right Now"}
{"text": "What's your favorite album to cook to?"}
{"text": "Ideas for using up my kansui?"}
{"text": "Made enfrijoladas for the first time"}
{"text": "What is the perfect Easter Sunday dinner?"}
{"text": "Is it good or bad to occasionally stir the pot when slow cooking a stew on the stove?"}
{"text": "Am I going to get sick?"}
{"text": "Favourite way of learning new recipes?"}
{"text": "How long do you leave bay leaves in stews?"}
{"text": "Bread pudding with bananas?"}
{"text": "Date night garbage"}
{"text": "Stuffed Chicken Wings"}
{"text": "Onion substitute that doesn't give stinky breath"}
{"text": "Is it possible to deep or shallow fry pollock fillets? will they break apart?"}
{"text": "Vegetarian/Vegan recipe sources that don't try to replace meat"}
{"text": "I want to make dough ahead for the next few weeks, but I don’t plan on baking more than one ball of dough every 2 weeks. How long can a ball of dough last stored? Can I freeze them or will that ruin them? What’s the best way to store them for making ahead? Does it change based on ingredients?"}
{"text": "Resources for preparing sushi at home?"}
{"text": "Recommendations for USA grown soybeans for soymilk? Organic, GMO Free preferred. Or any sources with good info?"}
{"text": "is it a noob move to boil rice with diced vegetables?"}
{"text": "Is there a shortcut to salt-cured egg yolks?"}
{"text": "Hey anyone knows of any cookbooks where they give you a monthly batch of ingredients to pick up and then all the recipes just draw from that monthly batch. I'm kinda thinking like a cheap eats kinda deal?"}
{"text": "Grapeseed oil?"}
{"text": "How to use Turmeric"}
{"text": "Overwhelmed with greens"}
{"text": "Browning meat without smoke?"}
{"text": "What do I do with frozen gluten? (Vietnamese seitan??)"}
{"text": "How to make potstickers/gyoza"}
{"text": "If you cook your onions on medium-high heat without fat they brown and caramelize within 5 minutes. Add the fat once they are on the way to keep them from burning."}
{"text": "Breakfast Lasagna: A Discussion"}
{"text": "Traditional tuna recipes?"}
{"text": "How long does preparing dinner take you? From prep to having everything cleaned? I feel like I am spending too much time."}
{"text": "Gimme your favorite recipes that are heavy on cilantro and dill!"}
{"text": "What's your favourite, in your area slightly unusual, seasoning?"}
{"text": "What to cook with a pound of green lentils?"}
{"text": "What healthy meal/snack do you crave or indulge in?"}
{"text": "How to make filling vegetarian meal?"}
{"text": "Do you need a baking/roasting dish if you have a cast iron?"}
{"text": "Is it wasteful to just throw whole cloves of garlic on the oven tray?"}
{"text": "Can I substitute our regular basil for 'Thai Basil' to make a Thai basil - ginger fried rice?"}
{"text": "Anyone have any tips for homemade kettle chips?"}
{"text": "Dry aging pork"}
{"text": "I want to know the story behind the food items, how it is used in specific recipes which are still not well known."}
{"text": "Great British Menu"}
{"text": "When making a mixed vegetable salad in a handheld vegetable chopper, with raw onions, carrots, peppers, tomatoes etc, how do I avoid the pungent taste of the onion? Do I use lemon? And can I add the lemon juice into the chopper or only afterwards?"}
{"text": "Guacamole as a meal. Good idea?"}
{"text": "I want to make Michelle Obama's apple pie, but the recipe calls for 3 store-bought pie crusts, will I have to triple a pie crust recipe?"}
{"text": "What can I do with a lot of cheese?"}
{"text": "How does one make 1 recipe 100 times, and not 100 recipes 1 time?"}
{"text": "Looking for some beginner vegetarian meals for a meat and veggie guy"}
{"text": "Healthier pasta sauce alternatives?"}
{"text": "Cooking risotto with the lid on...."}
{"text": "Uses for browned milk solids?"}
{"text": "HELP! First impression meal"}
{"text": "Braised Short Rib non alcoholic recipe?"}
{"text": "Why does yogurt look and taste different from sour cream when both are the product of the same process i.e acid acting on protein."}
{"text": "Combining beef fat and butter"}
{"text": "If a recipe calls for only egg whites or only yolks, can I freeze/store the other to use later?"}
{"text": "Where can I find a book that might have some info on the uses for whey, or a good book on food science pertaining to milk in general?"}
{"text": "How to make frozen veggies taste good?"}
{"text": "Favorite Chocolate Chip Cookie recipes??"}
{"text": "Does anyone actually like whole wheat pizza dough?"}
{"text": "What food do you wish you could make more often, but don’t because of the people around you?"}
{"text": "Pan size question for pros"}
{"text": "How much duck fat should I use for one large potato?"}
{"text": "What is your way of saving money on food or cooking?"}
{"text": "Hummus - what the fuck am i doing wrong?"}
{"text": "My cooking just isn’t good anymore."}
{"text": "What foods last a while before cooking/How do you keep a stocked pantry without food going bad?"}
{"text": "LEE KUM KEE soy bean sauce"}
{"text": "IKEA created a free cookbook for utilizing food scraps!"}
{"text": "To blanch or not to blanch"}
{"text": "Chuck Roast Prices"}
{"text": "Frozen french fries turned green"}
{"text": "Why can you really only get smoked paprika and what other spices should have smoked options?"}
{"text": "Any paid recipe sites without ads?"}
{"text": "Dairy free basting techniques?"}
{"text": "why do i keep seeing popular youtubers leaving onion peels in their cooking?"}
{"text": "What to do with a ton of dried spearmint leaves?"}
{"text": "Have any of you cooked in a terracota pot?"}
{"text": "Is orange curd as good as lemon curd?"}
{"text": "How do you prevent meatballs from falling apart?"}
{"text": "Small Deep Fryer Recommendation?"}
{"text": "Can I make salmon fat?"}
{"text": "Sides for burgers that aren’t potatoes?"}
{"text": "What are the nicest recipes to learn for a home cook?"}
{"text": "Is roux supposed to look like a liquid or a thick paste?"}
{"text": "Recipes from montenegro"}
{"text": "Any recipes for jalapeno poppers where bacon isn't a main feature?"}
{"text": "Is it ok to use wire thermometer in shimmering or boiling water?"}
{"text": "Canned Vs Dry Chickpeas"}
{"text": "MSG makes my sweat smell different?"}
{"text": "Im sick of eating fried chiken. What can you recommend to make with chicken. Wings breasts thighs and legs.i have it all"}
{"text": "Outdoor cooking"}
{"text": "Can I use glucose/cornstarch to thicken mousse?"}
{"text": "Starting over, what’s your recommended kitchen items."}
{"text": "Food Dehydrator Recommendations?"}
{"text": "Okay folks. I have lard. Freshly rendered and cooled. Snow White lard. Gimme your recipes. Please, and thank you."}
{"text": "Absolute Beginner with no knowledge in cooking whatsoever. Help?"}
{"text": "My new favorite bread recipe(s)"}
{"text": "Ways to improve buffalo sauce?"}
{"text": "I know people mostly come here to talk food and recipes but I'm a line cook and I wanted to tell people how I felt about it."}
{"text": "This is a simple idea, but I thought it might be helpful to some. When you make a nice cream soup, the next day you can use that cream soup as a basis for a cream sauce."}
{"text": "I got scratches on my pan, is it okay or should i replace?"}
{"text": "Mochi (NOT filled with ice cream)"}
{"text": "Help, what do I do with gomtang?"}
{"text": "Why are my cookies so cakey?"}
{"text": "Good dips for sweet potato fries?"}
{"text": "Dirty Rice - How much flavor will cooking the rice with all the ingredients add?"}
{"text": "On a scale of \"It was only sitting out for a few hours, it's fine\" to \"I scrub the outside of my stainless steel pans until they shine\", how anal retentive are you in the kitchen?"}
{"text": "What can I make with Grana Padano?"}
{"text": "What are Your Favorite Quick Breakfast Meals?"}
{"text": "white cooking wine?"}
{"text": "Are my baking tins salvageable? Burnt angel food cake"}
{"text": "How do you put the \"rad\" in radish?"}
{"text": "Looking for a large Stock Pot with a mesh insert."}
{"text": "Help finding a good pan set?"}
{"text": "Good Crepe Recipie?"}
{"text": "The rarest pan!"}
{"text": "Amazing deal for a pan set or too good to be true?"}
{"text": "How to pick the right rice for sushi?"}
{"text": "Lasagna!"}
{"text": "Fancy Brunch Help"}
{"text": "Have no method of heating up anything."}
{"text": "Making vegetarian orange jelly?"}
{"text": "Storing hot liquid in plastic squeeze bottle?"}
{"text": "Egg on the side (top) fried rice"}
{"text": "Kombu, wakame or other seaweed"}
{"text": "Food Thermometer"}
{"text": "When do you retire your non-stick pan?"}
{"text": "Your best tomato soup"}
{"text": "Does anyone have any idea of a good way to cook chicken gizzards?"}
{"text": "Where do you source unique-to-you ingredients?"}
{"text": "High moisture potatoes"}
{"text": "Waffle spread... mystery spread..."}
{"text": "Freezing Eggplant"}
{"text": "How do you make fluffy corn bread"}
{"text": "Basmati brown rice in a rice cooker?"}
{"text": "Cooking while drinking"}
{"text": "The best way to fry chicken/potatoes in a pan?"}
{"text": "alright peeps, give me your BEST mac n cheese recipe!!"}
{"text": "How to tell if Parsnip is bad?"}
{"text": "Will any carbon steel wok be fine for 5+ years?"}
{"text": "I have a question"}
{"text": "What is this brown stringy thing on/in my chicken breast?"}
{"text": "Washing hands"}
{"text": "Website that is good to find what side dish goes well with what?"}
{"text": "Slightly odd question"}
{"text": "This Week on the Menu: Week 3!"}
{"text": "Meal cooking/planning - feedback request"}
{"text": "Unpopular Opinion: Cornbread is a Dessert"}
{"text": "Biscuits and gravy (sausage?!): help an aussie out."}
{"text": "28/100??? Who does this? Help!"}
{"text": "Are marrow bones safe for people too?"}
{"text": "What does raw corn starch taste like?"}
{"text": "My fries won't harden! Why?"}
{"text": "mi first dish"}
{"text": "I am going through a noodles addiction and need ideas for something that will satiate me the same way"}
{"text": "Using up leftover roast chicken"}
{"text": "I'm In A Cooking Slump"}
{"text": "Does anyone else enjoy French Toast with HP sauce?"}
{"text": "Can we talk about garlic?"}
{"text": "HELP COOKING CHICKEN FOR THE FIRST TIME AT HOME"}
{"text": "Greasy Burger Help?"}
{"text": "Properly roasting a chicken?"}
{"text": "Looking for a spice grinder (1/2kg+)"}
{"text": "LA Times Food is publishing weekly dinner meal plans"}
{"text": "Making subway bread after a recipe. I want to freeze some of them, should I freeze the dough before baking and bake them fresh when I need them or afterwards?"}
{"text": "Foundational Cooking Skills"}
{"text": "If you cook a Steak? How long do you leave your seasoning on the Steak before you start cooking?"}
{"text": "Recommendations for an induction range?"}
{"text": "BCD Tofu House Banchan?"}
{"text": "Beef stew recipe w/ a lot of onion, slightly sweet and had white wine. Does anyone know this recipe?"}
{"text": "A terrible shooting just happened where I've lived most of my life. I stumbled back across this beautiful NYT article and recipe from the Thursday after 9/11, and... I think I'll cook today."}
{"text": "Ask Cooking: What's in Your Pantry?"}
{"text": "Is anyone else struggling to keep their dishes cheap?"}
{"text": "Dairy free recipes that aren't vegan"}
{"text": "Gift for someone who's into Italian cooking"}
{"text": "Best way to store tellicherry peppercorns?"}
{"text": "Any veg dishes you can suggest for a beginner?"}
{"text": "Can I treat the water that comes with cooked chicken as chicken broth?"}
{"text": "Who else likes to try and recreate restaurant / travel food favorites?"}
{"text": "What to do with Blue Cheese?"}
{"text": "I just got my first KitchenAid stand mixer: what do I make first?"}
{"text": "Frozen chilli went watery?"}
{"text": "I made soy sauce eggs / ramen eggs... what can I do with the marinade after I'm done?"}
{"text": "Sucralose"}
{"text": "My recipe for tiramisù, one of the most decadent desserts out there"}
{"text": "Is it possible to make fresh malfaldine without a kitchenaid?"}
{"text": "Give me your best ideas (w/ beverage pairing) for elevated breakfast for dinner (for a group)."}
{"text": "What is this dessert officially called?"}
{"text": "Best cooking app I've ever seen"}
{"text": "Cleaning is part of cooking too right?"}
{"text": "How do you actually use a meat thermometer?"}
{"text": "Vegetable oil on stove coils 😬"}
{"text": "Found an unmarked jar of spice in my cupboard. Smells like black licorice. What could be?"}
{"text": "Is anyone else annoyed with how supermarkets are removing the bones from almost all cuts of meat?"}
{"text": "In a slow cooked stew (days) is there any point keeping bones in after the marrow/soft parts fall off? Will bone keep adding flavor or something?"}
{"text": "Language related confusion about ingredients"}
{"text": "Any actual uses for freeze dried garlic?"}
{"text": "The endless battle in my mind between loving to cook and not wanting dishes is strong today!"}
{"text": "First Dutch Oven Recipe?"}
{"text": "Cooking without recipes as a home cook. Possible?"}
{"text": "Aloo Gobi recipe?"}
{"text": "Will my stock taste weird if I make it from the carcass of a smoked chicken?"}
{"text": "Broiler Safe Casserole Dish"}
{"text": "Dessert cookbook"}
{"text": "I need some large quantity vegetable dishes"}
{"text": "Easy Trout Recipes?"}
{"text": "What do you add to a chicken sandwich?"}
{"text": "Is there a rule for how much vinegar is too much for you?"}
{"text": "tips for making steaks in the oven?"}
{"text": "Just made mapo tofu and it is literally the strongest tasting thing I’ve ever had"}
{"text": "I want to get excited about breakfast and lunch!"}
{"text": "What terminology would I use when asking a butcher for beef bone marrow?"}
{"text": "Cooked chicken in green salsa last week. Is the salsa still good?"}
{"text": "I need advice on cooking Soba"}
{"text": "My roommate prepares food on top of the glass stovetop instead of the counter."}
{"text": "Today in weird fusion... Peirogi Kimchi Bokkeum"}
{"text": "Upping my lasagna game"}
{"text": "How does everyone store/organise their recipes that they want to make again?"}
{"text": "Wondering if I should make any modifications to my existing Chicken Tikka Masala recipe"}
{"text": "Cilantro/Coriander"}
{"text": "Any suggestions for dishes featuring Aa Choy?"}
{"text": "Ask Me Anything!"}
{"text": "Vegetarian Korean Recipes?"}
{"text": "Whole Foods Frozen Cod Fillets Taste Very Salty"}
{"text": "Sudden chemical smell/taste in all food i cook especially meat."}
{"text": "Does anyone else get anxiety about trying to get all the dinner items finished at the same time so they’re all hot and fresh?"}
{"text": "Cooking magazine"}
{"text": "How to make Homemade sushi"}
{"text": "Thai ground shrimp and chicken \"lemon grass nugget\"?; looking for the name"}
{"text": "Max Time Marinating Whole Chicken in Buttermilk? 24 or 48 hrs?"}
{"text": "Seasoning before or after cooking?"}
{"text": "Fried chicken doesn't come out right?"}
{"text": "Wasabi Soy Almonds"}
{"text": "What sentence in a recipe sends chills down your spine?"}
{"text": "Can I use lamb leg for Guinness stew?"}
{"text": "Can I use Truvia in the microwave?"}
{"text": "Anyone got any crunchwrap tips?"}
{"text": "Best single induction burners?"}
{"text": "How to cook a 96 oz steak?"}
{"text": "Here fishy, fishy... Walleye side dishes"}
{"text": "Drained weight of sauerkraut?"}
{"text": "Noob here: ISO a chicken-cutting apparatus for my mom"}
{"text": "Slow cookers aren't like they used to be."}
{"text": "Thinking about a use for my leftover whey."}
{"text": "Looking for a tasty entree recipe using yellow squash?"}
{"text": "Looking for things to do with browned bananas that is not bread."}
{"text": "Peel your asparagus"}
{"text": "Authentic Mexican rice recipes"}
{"text": "Chicken Parmesan Question"}
{"text": "This is probably a stupid question about ground spices."}
{"text": "Dutch Baby Issues"}
{"text": "Grilled chicken sandwich."}
{"text": "Is cooking therapeutic for you?"}
{"text": "Recommendations on the best frying pan"}
{"text": "Brining boneless chicken?"}
{"text": "Any chicken dishes that have that brisket-y texture?"}
{"text": "Seafood Cookbook Recs"}
{"text": "Recipe help?"}
{"text": "Preparing frozen tomatoes for soup?"}
{"text": "Is it safe to reuse vinegar-based quick-pickle liquid?"}
{"text": "Question for brainstorming ideas"}
{"text": "Spices For Chickpeas"}
{"text": "How to prevent chicken going dry?"}
{"text": "Advice on a berry cobbler or crumble"}
{"text": "Pressure cooking question"}
{"text": "Know any broiler-safe muffin tins?"}
{"text": "ways to use up a lot of carrots and mushrooms"}
{"text": "Replacing alcohol in recipes"}
{"text": "Anything as fun to grill as steak, but not meat?"}
{"text": "When should I add chicken thighs to soup?"}
{"text": "Getting rid of moisture in meat"}
{"text": "A1 sauce"}
{"text": "Best Avocado Sandwich Recipe?"}
{"text": "Challenge: Recipes for my friend with a million allergies"}
{"text": "What is your favorite kitchen tool?"}
{"text": "Experimenting in the kitchen— how to not end up with a disaster every time?"}
{"text": "Can't make friends with Salad"}
{"text": "What is the best way to keep Rosemary fresh?"}
{"text": "Moved out for the first time. What are the kitchen must have foods/ingredients?"}
{"text": "What happens to a gas hob if I apply high pressure instead of its manufacture recommended low pressure and vice versa?"}
{"text": "Just renovated my kitchen! Looking to replace all my utensils. Anyone know of a decent steel knife set that runs under 100$? Or just any decent knives in general?"}
{"text": "How to take beans to the next level?"}
{"text": "Why is it when I bought Ben and Jerry’s ice cream from a pizza store that the ice cream was frozen so much smoother and the ice was smoother around the tub too?"}
{"text": "Suggestions for duck stock"}
{"text": "Why is there only chicken sausage now?"}
{"text": "Green onions in place of leeks?"}
{"text": "Best completely puréed soup recipes?"}
{"text": "I need a food-chopping tool that is smaller and lighter than a food processor. Recommend a specific model?"}
{"text": "Trying to improve my cooking, but the shopping..."}
{"text": "Tips to start getting into spicy foods?"}
{"text": "Weak Soupe au Pistou?"}
{"text": "Chic Fil A sauce uses"}
{"text": "Knife and Physical location reccomendations (NCR, India)?"}
{"text": "I have a few kitchen appliances I don’t use often and I wanted recipe recommendations!"}
{"text": "Mushroom risotto"}
{"text": "I have pork ribs and very little time/energy."}
{"text": "Had leftover rotisserie chicken and made the best chicken salad sandwich. Other easy recipes?"}
{"text": "What's the best rice?"}
{"text": "Peanut butter pringles"}
{"text": "Uncut beef short ribs - help?"}
{"text": "Just got a case iron. Now what?"}
{"text": "Mustard based taco sauce or salsa?"}
{"text": "How the hell do you add parm to pasta without it clumping up?"}
{"text": "Dinner help requested!"}
{"text": "Going to an chinese / asian store tomorrow. What items (for you) are a MUST HAVE?"}
{"text": "Lemon pepper... orange pepper?"}
{"text": "How do you make tempeh taste good?"}
{"text": "I think I failed at cooking again..."}
{"text": "Dissolve or mix glucose syrup in water?"}
{"text": "How long do you spend in the kitchen per day to cook and server a 3 person household?"}
{"text": "Not sure what to cook with, or how to use salted sardines. I have three 600g tins of Italian “Sardine Salate”, so quite a bit.."}
{"text": "When a dish you make is missing a certain \"something,\" what are your go-to add in ingredients that save the day?"}
{"text": "Not sure if this belongs her but I’ll give it a go"}
{"text": "Your favorite way to cook hotdogs indoors"}
{"text": "What, besides pizza, can I cook in my countertop, electric pizza oven?"}
{"text": "Listeria from raw tuna?"}
{"text": "My eyes are super sensitive to onions. What helps?"}
{"text": "Microplane"}
{"text": "Hungarian Spices"}
{"text": "What are your favorite sides to have with chicken cutlets?"}
{"text": "Chef’s Knife Recommendation?"}
{"text": "What to do with nice canned smoked salmon?"}
{"text": "Extremely picky eater HELP"}
{"text": "question?"}
{"text": "The beginning of a spicy collection"}
{"text": "Secrets to flavorful stock from veggie scraps?"}
{"text": "I baked a corned beef brisket instead of braising it and it's unbearably salty. Is there any way to salvage this?"}
{"text": "Best meat alternative"}
{"text": "Moved out for the first time. What are my cooking essentials that I must have?"}
{"text": "Favorite ways to cook peas?"}
{"text": "When using the casserole dish, why keep the top open versus closed, and how do you control the effect of the temperature on the food and meat either way?"}
{"text": "Professional chef vs meat thermometer"}
{"text": "I left cooked chicken and mashed potatoes (that has heavy cream and butter) sitting out for 3 hours. Bad?"}
{"text": "My roommate hates the smell of a certain recipe, can I make it in a pan on the bbq?"}
{"text": "Looking for some good Japanese cooking YouTube channels, any suggestions?"}
{"text": "Help needed: my boyfriend is starting to get really interested in cooking and I want to gift him something special. What would you have wanted to get when you started?"}
{"text": "Does anyone else feel so spent afher cooking that you don't really eat what you cooked other than to taste it? It feels like the act of cooking fills me up and I can't eat what I've cooked unless a few hours pass."}
{"text": "Does grating cured egg yolk into a hollandaise sound like a good idea?"}
{"text": "Help. I need a cat resistant toaster oven."}
{"text": "New SS Cookware Set"}
{"text": "Recommendations for pans"}
{"text": "White bubbles on rib-eye - never seen this"}
{"text": "Help making chili oil"}
{"text": "Pickling Green Peppercorns"}
{"text": "What can I use red cabbage for??"}
{"text": "Any advanced cooking books for an ambitious home chef?"}
{"text": "What is the superior potato for oven or air fryer fries?"}
{"text": "Can I cook unopened bacon bits that I left in room temperature for too long?"}
{"text": "How to reheat Jamaican patties properly?"}
{"text": "In praise of Greek yogurt"}
{"text": "I got rid of all my non stick pans and I should have done that ages ago!"}
{"text": "Adding fat to lean ground beef"}
{"text": "About a Week ago I had asked if it was possible to make a stir-fry with Rolled Oats. Well everyone, it is- and here's the recipe!"}
{"text": "What’s the best spice grinder for making chili powder?"}
{"text": "How to store a 50lb. bag of flour?"}
{"text": "Removing excess water from frozen mince?"}
{"text": "If you or a loved one is constantly stressed about food timing, and you have $70-100 to drop on an appliance/gift, consider a home culinary heat lamp."}
{"text": "Pho vs Ramen"}
{"text": "What makes a good carpaccio?"}
{"text": "New ideas for a whole chicken?"}
{"text": "Is this Crockpot nonstick?"}
{"text": "Chicken. Ugh"}
{"text": "Tuna steak advice"}
{"text": "Heart of Palm flavor pairings?"}
{"text": "Tell me your favorite thing to cook!"}
{"text": "For cooking and not drinking purposes, how long would an opened bottle of white wine last in the fridge?"}
{"text": "Does a new york strip have the same name in other countries/languages? If so what are some other names for cuts of beef?"}
{"text": "Should I marinate my chicken before frying it (for recipes like, say, Orange Chicken)??"}
{"text": "Granite mortar &amp; pestle leaves behind rock dust"}
{"text": "Corned Beef and cabbage question."}
{"text": "Lifelong vegetarian trying fish for the first time. What do cod, sea bass, and kampachi have in common? What else might I like?"}
{"text": "Tabletop grill question please help!!"}
{"text": "Where can I buy GOOD alkaline ramen noodles in the UK?"}
{"text": "What's your personal technique for breading meat for cooking?"}
{"text": "Best egg-free noodles for lo mein?"}
{"text": "Barenaked Noodles"}
{"text": "Easy recipes with miso?"}
{"text": "Is there a way to get the jalapeño taste out of jalapeños without the spice?"}
{"text": "Sous vide steaks for the first time"}
{"text": "Are onions attracted to water?"}
{"text": "When in doubt throw it out, but..."}
{"text": "Holes/vents/slits at the bottom of an oven?"}
{"text": "Sashimi salmon"}
{"text": "Looking for authentic greek Pastitsio recipe"}
{"text": "Sushi Struggle"}
{"text": "Stainless steel pan shortage?"}
{"text": "A pot holder accidentally went into oven with potatoes and it turned black but didn't burn. Can I still eat the food?"}
{"text": "Is there a difference between macarons and meringue?"}
{"text": "Recipes like beef goulash?"}
{"text": "Stainless steel pan"}
{"text": "Help me use two Giant Lockdown cans"}
{"text": "What vegan sides would you put with these dishes?"}
{"text": "spice experiments"}
{"text": "What extras should I add for my mac' n cheese?"}
{"text": "Is it worth aging Wagyu?"}
{"text": "I messed up and I'm not mad about it."}
{"text": "Zero-waste options to store frozen food"}
{"text": "How do I recreate 4 cheese spaghetti sauce at home?"}
{"text": "If I have a toaster oven, and I’m making roasted carrots, and broiled lamb rib chops, how can I do the two together?"}
{"text": "I possess 50 grams of parm, it is pretty hard to find in my country. I wanna right by it, what should I make?"}
{"text": "Does the material which provides this pot nonstickness post health risk?"}
{"text": "Trying to find a cookie recipe"}
{"text": "freezer chicken"}
{"text": "Ruined All-Clad?!"}
{"text": "Spam ideas"}
{"text": "Knife Brand Reccomendations"}
{"text": "I invented a new food but I couldn't make a professional one, could any butchers do this?"}
{"text": "Thoughts on this recipe? -Spirited away banquet chicken"}
{"text": "Easy tuna recipe"}
{"text": "Can't thicken the cream"}
{"text": "What's your best hummus recipe?"}
{"text": "Wife leaving for the airforce soon. Need to figure out how to meal prep for myself and 2 kids as well as plan ahead grocery trips"}
{"text": "Herb garden help"}
{"text": "Kitchen tools that save space or time?"}
{"text": "How does cherry pie taste like? Is it better then pumpkin pie?"}
{"text": "Cooking habits, kitchen appliances, and their shortcomings"}
{"text": "Why put sugar in stir fry?"}
{"text": "Cookbook: baby steps"}
{"text": "How do you make a pasta dish creamy?"}
{"text": "summer is coming. What grilled should I look for(less than $300 or less)"}
{"text": "What are your favorite mix-ins for banana bread?"}
{"text": "Heya, what could I do with frozen fish balls??"}
{"text": "Knorr stock pots for risotto"}
{"text": "I screwed up. Will I get sick?"}
{"text": "Anyone ever cooked with real wasabi leaves and stems?"}
{"text": "Sichuan peppercorns taste soapy?"}
{"text": "How do I (politely) turn down a dish that was cooked for me that I don’t want to eat?"}
{"text": "So about your fried rice..."}
{"text": "I started cooking my dried pasta like rice and I'm never going back."}
{"text": "Using too much oil"}
{"text": "New here , don't know if it is common knowledge that k have come across but Egg washing (only yolks)noodles+adding herbs like oregano after softening them gives them epic Taste and texture , this works well while making supermarket ramen - quantity being 1 egg yolk per 1 ramen pack."}
{"text": "What is your favorite healthy meal?"}
{"text": "Share your mashed potato recipe!"}
{"text": "How do restaurants press/drain tofu?"}
{"text": "Bone broth questions"}
{"text": "How can I cook a whole chicken with no oven?"}
{"text": "anyone else poor person cooking?"}
{"text": "I built myself a tool a kitchen management tool with a 'new recipes' suggester and much more."}
{"text": "Red beef enchilada recipe??"}
{"text": "Why is the butter greasy?"}
{"text": "Help--made syrup too thick"}
{"text": "Favorite dollar dishes from around the world?"}
{"text": "Which of the 8 cuisines of China does American Chinese food most closely resemble?"}
{"text": "Discoloring in candy?"}
{"text": "Wagyu tasting party!"}
{"text": "Local Farm raised duck eggs"}
{"text": "Who has a good chocolate bundt cake recipe?"}
{"text": "Baking Bread - Cutting Recipe in Half"}
{"text": "I know many people don’t pay attention to garlic amounts in recipes, but does anyone regularly swap broth for stock?"}
{"text": "Recipes for onion, potato, cheese, garlic, and eggs"}
{"text": "Best way to cook Wagyu?"}
{"text": "I need a recipe to teach my dad the importance of seasoning and not boiling vegetables"}
{"text": "Any recipes for beginners?"}
{"text": "USA regional Spices/Seasoning question."}
{"text": "White film on raw chicken?"}
{"text": "Does anyone have a good tomato sauce recipe for home made pizza ?"}
{"text": "When you host or go to a dinner party what is an appetizer/dish/dessert that you are expected to bring?"}
{"text": "Wooden or Stainless Steel Pizza Peels"}
{"text": "Naming Dish/FoodTutorial?"}
{"text": "Gas oven will not brown foods... burnt bottoms"}
{"text": "Garlic press/rocker recommendation"}
{"text": "Getting bored of straining sauces through a strainer. What device do I need to automate it?"}
{"text": "Roaring 20s Fine Dining Menu?"}
{"text": "What to do with failed fish fillet?"}
{"text": "Tuna fork in mayo jar?!"}
{"text": "Keto caramel split and runny. Is it possible to salvage for a cheesecake topping?"}
{"text": "Broth/stock changed color overnight"}
{"text": "What book did you learn the most from cooking wise?"}
{"text": "Black stuff coming out of cracks in casserole dish"}
{"text": "LPG gas regulator"}
{"text": "What is your favourite bare-minimum-effort food?"}
{"text": "Can anyone suggest a good bison stew/ soup recipe"}
{"text": "Any recipe recommendations for almost 1kg of ground flaxseed meal?"}
{"text": "Grinding petite filets"}
{"text": "Trouble perfecting my steak"}
{"text": "Hot link recs?"}
{"text": "What's a dish that looked good and you thought you were going to like but didn't?"}
{"text": "Help needed!"}
{"text": "Kewpie mayo in ranch?"}
{"text": "Suggestions for stuffed chicken breast"}
{"text": "White Sangria wine choices?"}
{"text": "Help: honey-based dinner dishes!"}
{"text": "Recipes that use pickled peppers?"}
{"text": "Cookware suggestions"}
{"text": "What is your culture’s pancake recipe?"}
{"text": "How is a square 12 inch frying pan measured? Corner to corner? Or side to side?"}
{"text": "Chicken and rice is my favourite combination in all of cooking. What are some specific chicken with rice combinations (iconic or unexpected) that you know and love?"}
{"text": "My Lasagna Recipe"}
{"text": "Is this cream spoiled?"}
{"text": "Freezing popcorn chicken"}
{"text": "What are good ways to prepare whole artichokes?"}
{"text": "Are these butternut squash good (not spoilt) to cook?"}
{"text": "Le Creuset Cleaning Question"}
{"text": "Favorite informative cookbooks?"}
{"text": "Oven burning bottoms of everything - HELP!"}
{"text": "Roast and vegetables are plain"}
{"text": "Cooking steaks, break between two steps"}
{"text": "Science of cooking..any suggestions?"}
{"text": "HELP MY FRIED CHICKEN ISN’T WORKING"}
{"text": "How do you find the drive to cook for just yourself?"}
{"text": "Making sushi/maki rolls one-handed?"}
{"text": "I feel like I killed my stomach with my cooking mistakes."}
{"text": "What do you like to eat that's \"wrong\"?"}
{"text": "Eggs to fish n chips batter yay or nay?"}
{"text": "When a cake calls for yogurt?"}
{"text": "How do I boil milk for stovetop oatmeal without getting a layer of burnt milk on the bottom of the pan?"}
{"text": "Looking for a kitchen island"}
{"text": "Newbie Hack On Cooking Rice"}
{"text": "Is a tortilla with tomato sauce and spices a thing?"}
{"text": "Thermapen...worth it? Or not?"}
{"text": "Where are YOUR go to places to get recipes?"}
{"text": "Will a dish made from mutton, chicken, fish, prawns, mushrooms, bell peppers, peas and carrots seasoned with Indian spices be fit to eat?"}
{"text": "MSG fried rice?"}
{"text": "What to do with leftover cheese sauce?"}
{"text": "Cinnamon rolls"}
{"text": "Help! My eggs are always going cold too quick"}
{"text": "Cooking book that doesn’t Require a lot of Greens"}
{"text": "Know any tasty wild garlic recipes?"}
{"text": "What's the best way to cook chicken breast fast?"}
{"text": "What's a cooking tip/strategy/hack that greatly increased your cooking efficiency?"}
{"text": "How do I cut carrots?"}
{"text": "Immersion Blender Hacks/Recipes?"}
{"text": "Have you ever made mistake in kitchen but turn out to be better than expected?"}
{"text": "Is “sweet glutinous rice flour” the same as just “sweet rice flour”?"}
{"text": "I'm making ribs tonight (again) and I need a really good, cheesy, baked Mac and Cheese recipe."}
{"text": "Thaw ground beef"}
{"text": "Bacon that’s been opened in the fridge for 2 weeks?"}
{"text": "If you have kids (or not) the new show Waffles and Mochi is fantastic."}
{"text": "How to thin out bechamel sauce?"}
{"text": "What's something you tried to cook from scratch but failed so far ?"}
{"text": "What to do with about 1.5lbs of pork shoulder?"}
{"text": "My go-to roast chicken"}
{"text": "3 year old frozen turkey"}
{"text": "Egg Roll in a bowl...where have you been all my life? &lt;3"}
{"text": "My Mochis are all terrible!"}
{"text": "Have few questions regarding the ingredients for my burger bun dough"}
{"text": "Can I leave food in the oven after it cooks?"}
{"text": "Can we discuss Chicken Tikka? Would particularly like to get input from folks familiar with Indian/Pakistani cuisine."}
{"text": "Tips for cooking on spiral electric burners?"}
{"text": "Books on how to become a \"Hostess with the mostest\""}
{"text": "Quick Frying Wings After Smoking?"}
{"text": "Beef Short Ribs"}
{"text": "Anyone have tips for how to make my curries taste more balanced/curry-cooking tips in general?"}
{"text": "Need your ideas and recipes"}
{"text": "Hot smoking in a wood oven"}
{"text": "Thickening pot pie filling with mashed potatoes"}
{"text": "Man, I am so undeniably grateful that they are SOOO many foreign grocery shops in my city!"}
{"text": "What's the equivalent of Williams Sonoma in other countries?"}
{"text": "What is better if prepped/made ahead of time/the day before?"}
{"text": "PSA: \"Mary Berry Cooks to Perfection\" Kindle book is currently USD 1.99 on Amazon"}
{"text": "A verdict on mushroom and apple combination."}
{"text": "What are some good Nitrate free recipes?"}
{"text": "What inspired you to begin cooking?"}
{"text": "Help saving a recipe!"}
{"text": "How do you buy crab legs?"}
{"text": "Is there something i can use instead of sugar for cheese cake"}
{"text": "Where do I start with crab?"}
{"text": "If I add water to a heavily cream based sauce will the cream or water burn off first?"}
{"text": "Guacamole As It Should Be Made"}
{"text": "Le Creuset vs Staub? Enameled cast iron crepe pan"}
{"text": "Recipe ideas for a mechanically altered diet?"}
{"text": "To all the experts out there, Can I use shop bought bbq sauce as a marinade/cooking sauce. I have a 1kg pork loin and want to do a bbq roast in the oven. Any help much appreciated."}
{"text": "If halfway through using a bag of wraps you notice one had mold on it, do you throw the rest of them away or only the one with the mold?"}
{"text": "Demi glacé"}
{"text": "Dear Spice Lords, What Are Your Preferred Recipes With Szechuan Peppercorns?"}
{"text": "Let's play hide the anchovies"}
{"text": "Extracting the exact quantity of each ingredient from grandma's recipes even though she cooks from memory and never measures anything"}
{"text": "Why are my pancakes terrible?"}
{"text": "Most expensive ingredient you'd ever tried?"}
{"text": "Cooking liver safety question"}
{"text": "where to watch The Complete Pepin: Techniques and Recipes"}
{"text": "Refreezing defrosted chicken breast \"help\""}
{"text": "Can I bake different flavoured cookies in the same baking sheet?"}
{"text": "Avoiding Raw Garlic Sharpness"}
{"text": "Can anyone help me figure out what this dish is?"}
{"text": "This might be a weird question but: how many of you warm up your pancake syrup?"}
{"text": "What foods do you only eat whilst on holiday? What foods remind you of childhood holidays?"}
{"text": "Interesting uses for cranberry sauce?"}
{"text": "Best ways to enjoy peanut butter?"}
{"text": "Using up onions"}
{"text": "Lentil Shop for One Person?"}
{"text": "What dumb cooking experiments have you done and how did they turn out?"}
{"text": "Is it possible to modify a Jerk recipe for someone who can’t have spicy food?"}
{"text": "Milk frother that's good for eggs?"}
{"text": "King Whetstone Question"}
{"text": "I wanted to try making this recipe on NYT"}
{"text": "Is it ok to bake with slightly sour heavy cream?"}
{"text": "Question - How healthy is baked breaded chicken?"}
{"text": "Recipe idea help"}
{"text": "Any books on (simple) cooking using the oven?"}
{"text": "What do you consider to be the gateway seafood to someone new to it?"}
{"text": "How do I remove burnt rice from a steel pot?"}
{"text": "Help me finish this Indian feast!"}
{"text": "Looking for help buying my first ever proper set up for cooking on a new cooker"}
{"text": "Has the recipe for butter changed?"}
{"text": "Vegetable peelers... what's your favourite?"}
{"text": "Cosco All-Clad d5 Stainless Steel 13-piece Cookware Set worth price?"}
{"text": "Why did my chicken turn out chewy"}
{"text": "Help I don't want to waste a brisket"}
{"text": "Ranch + Philadelphia cream cheese?"}
{"text": "Pizza Stones"}
{"text": "Chicken and pasta dish with minimal seasoning?"}
{"text": "Homemade pasta that is not too tough"}
{"text": "how to make puff pastry less... chewy?"}
{"text": "What \"impressive\" recipie do you make thats actually ridiculously easy?"}
{"text": "What to cook with mostly leafy greens and onions?"}
{"text": "Suh fellow cooking enthusiasts!"}
{"text": "I feel really good about being able to turn random pantry items into what I'm craving"}
{"text": "Just bought Diamond Kosher Salt"}
{"text": "HELP NEEDED!!! Yam/Taro Croquette dough is not coming together."}
{"text": "Looking for a recipe and maybe even more specific name for a thai dessert dish"}
{"text": "When does freezer burn start to affect the quality of the meat? Vacuum seal necessary for long-term storage?"}
{"text": "Beef question"}
{"text": "Sick from Korean BBQ?"}
{"text": "Fun Fact: Raw mushrooms are indigestible by humans and have no nutritional value!"}
{"text": "A little guide on how to look for good recipes online"}
{"text": "Melted a plastic wrapper to the bottom of my pan"}
{"text": "So I'm having a Debate with Someone"}
{"text": "Anyone know of a slowcooking sub that doesn't just mean slowcookers?"}
{"text": "I finally cracked how to make restaurant quality American fried rice"}
{"text": "I've been searching for a perfect recipe for each cake and here is a common trend I noticed"}
{"text": "Carrot and swede"}
{"text": "How to maintain heat in an alkaline solution for pretzel making?"}
{"text": "I bought myself a Cast Iron instead of a stainless steel and these are my thoughts"}
{"text": "How To Cook Fried Noodle (Malaysian Mamak's Style)"}
{"text": "Is Jamie Oliver stupid?"}
{"text": "What is your country's version of Hamburger Helper or packaged dinner shortcut?"}
{"text": "On Fridays, we make couscous"}
{"text": "How can i save my pot of chil?"}
{"text": "What spread/topping goes best for banana bread?"}
{"text": "What is your preferred time/temperature to cook two quiches?"}
{"text": "Something Impressive?"}
{"text": "What exactly is this noodle??"}
{"text": "What's the nicest way to fry boiled chicken?"}
{"text": "Picnic Ideas?"}
{"text": "Frozen Lunch Ideas?"}
{"text": "How do I cook a meal with many different sides all at once?"}
{"text": "What to do with duck organs?"}
{"text": "What can I do with leftover ground mahlap/mahleb?"}
{"text": "What is the single best kitchen tool you've bought?"}
{"text": "Just realized that I can make my fritatas/open face omlettes like really scuffed keto pizzas for dirt cheap since eggs are less than a dollar a dozen where I live."}
{"text": "Looking for Ideas to Use Up Pearl Barley"}
{"text": "What frosting for blueberry cake?"}
{"text": "Immersion blender rec"}
{"text": "If you were to create a template for soup, what essentials components would you include and why?"}
{"text": "Cooking Chilli Con Carne- question about tomato based sauce instead of diced tinned tomatoes"}
{"text": "WHAT IS ON MY FOOD??!!"}
{"text": "We made roasted garlic olive oil! (With a couple shallots in there for fun) We love it and can't wait to make other flavored oils--any suggestions on base oils or other flavors to try?"}
{"text": "Hakurei Turnips?"}
{"text": "What are your favorite sandwiches and wraps that you like to make?"}
{"text": "Rookie chef here"}
{"text": "Bland fried chicken after using an entire bottle of super hot sauce"}
{"text": "What should I do with subpar cocoa powder?"}
{"text": "What is your favorite recipe for boneless short ribs?"}
{"text": "Anyone else add chilli powder to their eggs?"}
{"text": "Can we normalize Not grinding whole spices for everything?"}
{"text": "Plantains not turning yellow?"}
{"text": "Anything similar to chili for newbies?"}
{"text": "Wisdom teeth out. Soft food ideas in?"}
{"text": "Blush sauce?"}
{"text": "Red wine substitute for cooking"}
{"text": "Looking for a way to prepare liver that doesn't make me gag"}
{"text": "Recipe to use up pre-made iced chocolate mud cake"}
{"text": "Moelleux au Caramel troubleshooting"}
{"text": "Wooden spoon set?"}
{"text": "Chocolate Egg Custard Tart?"}
{"text": "Why do my canelés come out like this?"}
{"text": "How would you cook eggs for a person who is tired of them?"}
{"text": "Which competitive cooking show can you learn the most from?"}
{"text": "How to restaurants make salads so good?"}
{"text": "Bought these rice cracker things that look and taste like styrofoam. Even when you bite the crunch sounds like styrofoam. I hate wasting food but don’t know what to do with it. Any suggestions?"}
{"text": "I Want To Slow Roast Tomatos for the Viral Feta Pasta Video"}
{"text": "Hamilton Beach Toaster Oven/Air Fryer?"}
{"text": "Nice to meet you, I'm Picklestone!"}
{"text": "Brownies Help!!!"}
{"text": "Tabletop grill ideas"}
{"text": "Using fresh vs frozen salmon for a salmon burger"}
{"text": "Onion Tears"}
{"text": "Question about frying"}
{"text": "Going to make homemade Gnocchi. I wanna get fancy with it. Any particular Gnocchi dishes or sauces you recommend? A fantastic Gnocchi dish you’ve had at a restaurant?"}
{"text": "What should my first homemade sausage be?"}
{"text": "Other uses for rib roast?"}
{"text": "I know there’s a lot of these questions, but I never thought it would happen to me. I suddenly have 35lbs of potatoes. There’s no way I can go through these before they rot. What do I do with them?"}
{"text": "Best rub / rubs for bbq ribs"}
{"text": "I found a mystery red meat fish steak in my freezer, any ideas what to do with it?"}
{"text": "My neighbor gave me fresh chicken and fresh duck eggs. Any recommendations on what to do with them."}
{"text": "Does anyone have a good building base for ice cream"}
{"text": "How do I make a cheese sauce that isn’t powdery?"}
{"text": "Trying to recreate a tangy sauce I used to make, forgot how to do it."}
{"text": "00 flour"}
{"text": "Shallots are OP"}
{"text": "Looking for ideas"}
{"text": "Fettuccine Alfredo"}
{"text": "Brand new baby, baby! Casserole ideas?"}
{"text": "Best way to improve Kimchee?"}
{"text": "How to get rid of fishy smell from anchovy stock?"}
{"text": "Mold for Caramel"}
{"text": "Hey, y'all ever ate sow belly and hand slung chitlins?"}
{"text": "How to get from advanced to Masterchef level"}
{"text": "Terribly annoyed at making pate a choux!"}
{"text": "A liquid filling to replace the yolk of a poached egg? I would serve it with rice"}
{"text": "Which Blogs/Websites are your go-to's for reliable recipes?"}
{"text": "Defrosting a steak in water bath and there was a pinhole in the Ziploc. Bag filled up with water. Cook or toss?"}
{"text": "Wancle Sousvide Temperature problem"}
{"text": "Made Indian food last night and ..."}
{"text": "Chicken stock from raw or cooked carcass"}
{"text": "Tube of Kroger Italian Herb Foccacia"}
{"text": "I've got 2kg of ground veal. What should I make besides meatballs?"}
{"text": "What can I add to sweet onions to make them more like yellow?"}
{"text": "Risotto Help"}
{"text": "Got Me A Mandoline"}
{"text": "Why did my lacto pickles get moldy?"}
{"text": "What’s a recipe that you invested time into perfecting?"}
{"text": "Recipe Ideas?"}
{"text": "What is your LEAST used common kitchen tool?"}
{"text": "Suggestions for tweaking my banana pancakes?"}
{"text": "What on earth to do with Yum Yum sauce?"}
{"text": "Got my Pork Shoulder Picnic in late, what temperature would you cook 6.4 lb (2.9 kg) for it to be done in 8 hours? (1 hour rest after that)"}
{"text": "Need help in prep for beef silverside"}
{"text": "I need to cook a roast in one kitchen and then sear in another. Bad idea?"}
{"text": "Q: What do Tomatoes, Onions and Aubergines, have in common? A: You can stuff them with rice to make Tangy Iraqi Dolma. Full recipe inside"}
{"text": "Leftover Cheese Inspiration"}
{"text": "College student buying pans"}
{"text": "What is the best fudgy brownies recipe?"}
{"text": "I want to cook fresh mushrooms. What is your best advice for preparing, cooking, &amp; *enjoying* them?"}
{"text": "I need help with my veggie broth"}
{"text": "Overnight spaghetti is the best"}
{"text": "Carnitas didn't brown"}
{"text": "Cooking pasta, any suggestions for what to add?"}
{"text": "Basic Vegetable Stock"}
{"text": "It's dare night with someone you just started seeing but are very interested in. You want to cook for them and impress them. What do you make?"}
{"text": "Different frying methods?"}
{"text": "I think the new Walker show was a horrible disgrace, but it did give me some new cooking ideas before I changed the channel."}
{"text": "Seeking Massaman Curry recipe."}
{"text": "What veggie stuff goes well with cornbread?"}
{"text": "Hfjdje"}
{"text": "Newly acquired cast iron tips"}
{"text": "What are your favourite ways to use maple syrup?"}
{"text": "Toasters"}
{"text": "Why does food always taste better when somebody else cooks it?"}
{"text": "Juniper berries?"}
{"text": "Recipes for college"}
{"text": "How on earth do you remove burn stains on the side and bottom of a stainless steel pan"}
{"text": "Basic Fish Stock - not an every day but great for poaching fish"}
{"text": "Why does my fried chicken always taste like oil?"}
{"text": "What is the quintessential sausage/ preserved meat of your country or state?"}
{"text": "What TV shows would you suggest to someone that are actually good in terms of technique and quality?"}
{"text": "I've only seen people do red onion pickles. Are white, yellow, or sweet onion pickles any good?"}
{"text": "For a shoyu ramen, would an aroma oil using green onion and garlic be ideal or would chicken fat be better?"}
{"text": "Nutmeg: A short story of my search for flavor"}
{"text": "Any recommendations for something delicious but also super fun to make?"}
{"text": "Is there a way to solidify condensed milk?"}
{"text": "Advice on what to do with LOTS of chicken stock?"}
{"text": "Need help with an idea that may or may not be good."}
{"text": "Sorting the beans"}
{"text": "Vegan Chocolate chip cookies"}
{"text": "Basic Brown stock - Beef or Veal"}
{"text": "What are some good ways to use Duxelles?"}
{"text": "Regarding \"sausage\"..."}
{"text": "What's you're tried and true rice method?"}
{"text": "Food processor - Panasonic, Bosch or Molineux??"}
{"text": "What are some good skinless sausage recipes aside from breakfast sausage?"}
{"text": "Basic Chicken stock. A staple for every freezer"}
{"text": "What are some of the standard ingredients that are used in many recipes?"}
{"text": "Garlicky Salad Dressings"}
{"text": "I don’t know if I’m allowed to post this here but is it strange that I kinda want to eat raw bacon because of its smell?"}
{"text": "Has this existed before?"}
{"text": "Black Bean Paste Chili?"}
{"text": "Eggs and Spinach combination, a perfect recipe from South Asia (India) Sunday brunch."}
{"text": "A great and easy tart recipe."}
{"text": "[Help] Spicing up Spaghetti Bolognese"}
{"text": "I don't want to kill my friend who is allergic to paprika."}
{"text": "What should Cajun Jambalaya taste like?"}
{"text": "Best store-bought seasoned breadcrumbs?"}
{"text": "Some resources for authentic Indian recipes without tomato"}
{"text": "Cod at Safe Temperature Still Translucent"}
{"text": "Need recipes for whole chicken!"}
{"text": "What are grits? I’ve never had them, never heard of anyone eating or cooking them? Is it an exclusively American thing?"}
{"text": "I bought buffalo mozzarella today for pizza and it was terrible, is it supposed to look like this?"}
{"text": "Anyone else remove the guitar strings from the celery?"}
{"text": "Which staples should I get for Korean cooking?"}
{"text": "How much msg should I add to my chicken fried rice?"}
{"text": "Cornmeal Waffles - When, why, how"}
{"text": "Question about raw salmon in fridge"}
{"text": "What are the small hard lumps I sometimes find in boiled potatoes?"}
{"text": "Can anyone recommend some good tomato recipes for people who don’t like them raw?"}
{"text": "Looking for carbon steel pan"}
{"text": "Plating + Presentstion Tips"}
{"text": "Can I Eat Cabbage Raw?"}
{"text": "Oil for Nashville Hot Chicken bitter"}
{"text": "What do you think is the most underrated or undiscovered sauce?"}
{"text": "Basic Brown stock - Beef or Veal"}
{"text": "Basic Fish Stock - not an every day but great for poaching fish"}
{"text": "What to make for someone with gallstones?"}
{"text": "Whats that amazing red sauce at every korean restaurant called"}
{"text": "Beef Tenderloin"}
{"text": "Resources for creating fruit forward desserts?"}
{"text": "So I just made the Serious Eats Foolproof Pan Pizza"}
{"text": "Most delicious dish you've had where hero ingredient is dark leafy greens?"}
{"text": "Safety for chicken addition. Instant pot Soup"}
{"text": "Easy go to dinners"}
{"text": "Anyone else think they want to do a lazy evening and make a quick meal, only to read the 30 minute recipes and think “Well fuck that’s not going to taste great though, I might as well put in the two hours needed for this meal to be done properly” ?"}
{"text": "Sumac where to use?"}
{"text": "Ninja Blender Question"}
{"text": "Suggestions on a good pair of gloves?"}
{"text": "Tomato sauce cook fast or slow ?"}
{"text": "A Salad Conundrum"}
{"text": "Hosting our first crawfish boil on Saturday 🦞 Any tips, tricks, or recipes I can steal from fellow mudbug suckers??"}
{"text": "Clam juice in Rice"}
{"text": "Need new pots/pans"}
{"text": "Chow Mein - question about shaoxing rice wine"}
{"text": "Whenever I use that tomato &amp; basil sauce am I supposed to let that simmer first?"}
{"text": "How to grind nuts so that they are 100% smooth without a wet grinder?"}
{"text": "Hello there ive got a Pizza Question! Low fat mozzarella cheese vs full fat mozzarella cheese?"}
{"text": "What stainless steel pan to buy? 10 inch - need lid - chalphalon?"}
{"text": "I’m in desperate need of sacrilegious baking ideas!"}
{"text": "Recipe for gummy bears?"}
{"text": "Vegan chocolate chip cookies"}
{"text": "What is your favorite way to eat kale?"}
{"text": "Does pasta aglio e olio taste good?"}
{"text": "I had frozen burgers in one of those silver cool bags for 2 hours, they were frozen overnight. Okay to eat?"}
{"text": "Making the viral feta tomato pasta, what are some good side dishes to go with it?"}
{"text": "Bought a velaze cast iron roaster for 20€ used, was it a bad deal?"}
{"text": "Cookie recipe?"}
{"text": "Why would I grind?"}
{"text": "Korean fried chicken batter mix"}
{"text": "What are some things that can make a cooking beginner feel less horrible? Books, stories, experiences etc."}
{"text": "The ideal substitute for Asafoetida?"}
{"text": "does anyone know how to make stale bread less dry so it is not as stale?"}
{"text": "Safe to eat cooked chicken left out for 6-7 hours?"}
{"text": "how much sugar is good for a sugar stick?"}
{"text": "What is happening to my pizza cheese?"}
{"text": "Cookbook recommendations"}
{"text": "Small Scale Deep Fry Oil Management"}
{"text": "Reusing cooking oil"}
{"text": "Am I the only one who can't stand adding salt to food after it is cooked and served?"}
{"text": "How much does your All-Clad D3 Stainless 10\" and 12\" skillets weigh? I just received their D3 Everyday skillets and they seem \"light\""}
{"text": "how to prevent cooked fruit jam from hardening?"}
{"text": "Sandwich composition?"}
{"text": "Fish sauce"}
{"text": "Is all pectin the same?"}
{"text": "In what kind of recipes do you use fermented fish cubes?"}
{"text": "Classic alfredo sauce jar"}
{"text": "Basic Chicken stock. A staple for every freezer"}
{"text": "What is your favorite recipe app?"}
{"text": "Dry aged sauce"}
{"text": "Spicing up wraps"}
{"text": "Nothing I cook turns out well and it really depresses me. Advice from people with similar experiences?"}
{"text": "Running out of oat flavors. Give me your craziest!"}
{"text": "Good tomato sauce brands at the supermarket, TX, USA"}
{"text": "Just found out I’m allergic to the umbellifer family - alternatives and things to watch out for?"}
{"text": "Need advice for food stand in a market"}
{"text": "Grinding my own hamburger meat with a food processor."}
{"text": "I bought ground chuck (80% lean 20% fat) at my local Winn Dixie. I left it in the refrigerator for 4 days before putting it in the freezer for 2 weeks. I let it thaw out today and I’m cooking it now. Is it safe to eat?"}
{"text": "Strip steak in stew?"}
{"text": "Using toasted sesame oil to confit foods?"}
{"text": "I made corned beef and cabbage for an Irish person. They hated it. What did I do wrong?"}
{"text": "Help cooking chicken"}
{"text": "How to make noodles taste like instant noodles?"}
