{"text": "Coronavirus Megathread (Mar 2021): For travel-related discussion in the context of COVID-19"}
{"text": "Megathread: Young &amp; Wanting to Travel for the First Time (Winter 2020/2021)"}
{"text": "First trip out of (continental) North America: Cuba, early 2014 - Varadero, Trinidad, Havana"}
{"text": "Lake Humantay in Peru - December 2019"}
{"text": "Tell me your Australia travel stories"}
{"text": "I am a New Yorker that will be travelling to Bogotá, Colombia for one month (Apr - May) on a work trip. Never been to South America. Any tips?"}
{"text": "US Passport - Laminated Photo has a white blemish"}
{"text": "Easter Island | October 2021"}
{"text": "A few Ruskeala Express photos"}
{"text": "Are 24 hour passport and visas legi?"}
{"text": "Avianca airlines... please help me!"}
{"text": "What is a good place in the usa to visit with minimal walking"}
{"text": "Potentially lost US passport in UK, no proof of nationality?"}
{"text": "Spring Break trip to Whale Island, Khánh Hòa, Vietnam (near Nha Trang and Cam Ranh)- March 2021"}
{"text": "Recommended overland route(s) from South Africa to the Mediterranean?"}
{"text": "Need Help Priceline Canceled Flight"}
{"text": "Looking for tips for a trip to Cabo San Lucas"}
{"text": "Moscow Pics"}
{"text": "Ruskeala marble caves"}
{"text": "looking to travel on spring break to anywhere from chicago"}
{"text": "Dominican Republic 🙂 My first time seeing this absolutely stunning country."}
{"text": "Some photos from my last trip to Spain in July 2014."}
{"text": "Things to bring for 3 months trip"}
{"text": "Some impressions from my last roadtrip in july 2020 @ Großglockner High Alpine Road in Austria"}
{"text": "Looking at going to the USA Jan/Feb time. Any suggestions for places to avoid or are essential go-to's?"}
{"text": "Recommendation for places to visit/travel in the US?"}
{"text": "Malta in October"}
{"text": "Question on customs?"}
{"text": "6 Day Grand Canyon- South Rim, Zion Trip"}
{"text": "17 year old graduating high-school in 3 months, want to take a gap year in europe to figure out what I want to do."}
{"text": "Question about ID for flying domestically"}
{"text": "Advice!"}
{"text": "When is too much travel?"}
{"text": "Switzerland was never on my list, did a spontaneous hiking trip last summer. Very nice surprise!"}
{"text": "I have booked a ticket on Eithad where my middle name is not on ticket but on my passport."}
{"text": "Royal Davui Island, Fiji"}
{"text": "Taking a walk at Kunnur, A small town with yea plants as main source of income in Southern part of India. It drizzle most of the time and weather is always awesome. It's a place where I walk for hours....and still can't get enough of it."}
{"text": "Late July U.S. beach vacation advice - help me choose?"}
{"text": "Planning a bro trip. Is there an app or website that suggests a destination based on a list of a bunch of the activities we want to do?"}
{"text": "Looking for advice for visiting Tallinn, Estonia and Riga, Latvia"}
{"text": "RCI Timeshare Exchange Customer Service"}
{"text": "Travel December 2021"}
{"text": "Adults Only Hotel/Resort in United States Recommendations?"}
{"text": "What time do you prefer to fly?"}
{"text": "PTY Transit - Do we need to fill out the Health Affidavit?"}
{"text": "Can I make this layover? 36 minutes at BOS"}
{"text": "What do I do with passport photo?"}
{"text": "Is an 80L bag too much for a one day trip?"}
{"text": "Traveling with a pet"}
{"text": "Where to Honeymoon: Seychelles vs Maldives vs Bora Bora"}
{"text": "Need Help finding a TSA approved pet carrier for my dog!"}
{"text": "Few pics from Myanmar 2018"}
{"text": "U.K. resident US Citizens who have travelled home recently - how was your experience?"}
{"text": "Has anyone been to Dutch Caribbean ?"}
{"text": "Travelling alone (kinda)"}
{"text": "Favorite travel item? (Needing a gift for my dad!)"}
{"text": "Georgia (Europe) 1 Year VisaFree - Are Return Ticket, Itinerary, &amp; Accommodation Proof Required?"}
{"text": "Looking for a local guide for trekking the Lycian way in Turkey with a small group (April 2021)"}
{"text": "Traveling + prescribed medicine"}
{"text": "What are the most bike and pedestrian friendly areas of the USA that are worth a long visit?"}
{"text": "Starting in Taos"}
{"text": "Hostility towards people traveling"}
{"text": "Girl with a buzzcut"}
{"text": "To big to fly?"}
{"text": "Just got rejected for Global Entry for admitting to recreational MJ use (Washington State). Does TSA Precheck do this too?"}
{"text": "Dubai in November for 5 days, recommendation on where about to stay?"}
{"text": "Tungnaá river on our three week hiking tour in 2018 in Suðurland, Iceland"}
{"text": "Best place to stay in Curacao?"}
{"text": "Tropical paradise wanted"}
{"text": "Airline cancelled original flight. Current flights are more than double what i had originally paid for"}
{"text": "Travelling alone V with your SO/ partner"}
{"text": "View from Pantokrator, Corfu with Albania in the distance. Definitely worth the hike"}
{"text": "Thoroughly researched resource on cheap travel?"}
{"text": "Recomendable flights to Ushuaia from Buenos Aires?"}
{"text": "Central &amp; South America trip for 6 months after pandemic"}
{"text": "In the United States, what are your favorite East Coast beaches and why?"}
{"text": "Recommended flights from Nyc to Vegas"}
{"text": "Has Anyone taken the Amtrak Auto-Train Recently?"}
{"text": "Canadian travelling to NYC, use T-mobile SIM?"}
{"text": "Travel to US from France (from Monaco)"}
{"text": "Best luggage/carryon/bag for elderly to sit on while waiting in line?"}
{"text": "Grad trip to ALbufeira Portugal"}
{"text": "ATM with NFC in Mexico City?"}
{"text": "What do you think are some underrated places in the US?"}
{"text": "Recommendations for a non-walking intensive and relaxing ~2 week vacation"}
{"text": "Greenheart Work and Travel program?"}
{"text": "Passports Expired"}
{"text": "Spots in NYC"}
{"text": "Pictures taken from a hot air balloon in Sri Lanka. Great Experience."}
{"text": "Is there a website that will show flights from point A to B over the weeks?"}
{"text": "I just heard that it's common to have something bad happening on the last 5% time of a trip. Any truth in this?"}
{"text": "Why Oman is not more popular with tourists?"}
{"text": "Do people realize how beautiful Canada is?"}
{"text": "What is happening at Heathrow Airport?"}
{"text": "Advice on a hiking trip around Canada"}
{"text": "Recommendations of nature vacation for a solo traveler"}
{"text": "Driving or Flying? Florida to California"}
{"text": "Best cities for tourists near/in Bavaria?"}
{"text": "Help! Planning a US Southwest road trip - what to include?"}
{"text": "Where to go for 6 days in USA for two?"}
{"text": "Food in Kauai (Hawaii)"}
{"text": "Best flight option from Quito, Ecuador to Colombia at the last minute?"}
{"text": "Beach Mountain combination in North East of USA?"}
{"text": "USA Road Trip"}
{"text": "Tips on traveling to Alaska (places to see and how to get around)"}
{"text": "Seattle, San Francisco, Or LA?"}
{"text": "Syria Before the War"}
{"text": "Some pictures from Dresden and nearby Saxon Switzerland (2017)"}
{"text": "Central America/Caribbean/Mexico Travel Recommendations?"}
{"text": "Currency exchange - MEX airport or HUX airport?"}
{"text": "Visited Uppsala as a day trip yesterday, and so wanted to share some pictures of the domkyrka, one of the city’s most notable sites."}
{"text": "Can I travel internationally with a paper ID and a passport?"}
{"text": "September Honeymoon Travel"}
{"text": "What are the best three or more cities in Europe that are close to eachother?"}
{"text": "Mega-Trip Combo"}
{"text": "Recommendations for London?"}
{"text": "Advice on the best time of year to visit Galapagos, Machu Picchu, and Easter Island"}
{"text": "What percentage of international tourists do you think travel without insurance?"}
{"text": "Doing some more traveling in my home country, Romania. Same place, different seasons (fall/winter, Ceahlău Mountains). Bonus some Roe deers."}
{"text": "Flighthub Not Issuing Refund, What Should I Do?"}
{"text": "Mexico City just a couple months before the rona"}
{"text": "Road Trip - Where to stay overnight?"}
{"text": "Tentative Iceland Ring Road Itinerary for August, stopping point suggestions?"}
{"text": "What are some cool small beach towns similar to Puerto Vallarta Mexico?"}
{"text": "Traveling with pet in cargo"}
{"text": "Girlfriend (20F) wants to travel for 6 months+ I (24M) don't."}
{"text": "Slow flight refunds: would you mind less if airlines/agents were more transparent"}
{"text": "Charleston, SC Chill Beach Suggestion"}
{"text": "Cairo trip from Hurghada"}
{"text": "How difficult is it for a vegetarian to travel abroad"}
{"text": "Signature dining for Cincinnati Ohio!"}
{"text": "Are there any alerts you can set up to see flight deals from your city."}
{"text": "Traveling to the uk question about documents"}
{"text": "Hi Guys I'm hoping to find out a little info about air travel with a dog from Germany to ireland (hopefully I'm posting this in the right place)"}
{"text": "Traveling Direct Flights"}
{"text": "Ever try sleeping at the airport? LAX or another"}
{"text": "Recent trip to Stewart Island, New Zealand"}
{"text": "travel from portugal to andorra"}
{"text": "Any Americans traveled to Costa Rica recently?"}
{"text": "Tulou - fortified communal residences of Hakka people in southern China. Usually round or rectangular shape, they can house hundreds of people."}
{"text": "Guatemala in the Before Times"}
{"text": "Traveling to Denver for the first time, looking for recommendations on outdoor recreation, restaurants and place to stay."}
{"text": "Toronto Mid Sept Options"}
{"text": "Seeking recommendations for best views or places to stroll in New Orleans"}
{"text": "Where to stay in San Francisco for two days?"}
{"text": "Bus Route South of Puerto Vallarta"}
{"text": "Need recommendations for anti-theft mini backpack?"}
{"text": "Update from The Australian woman who had to flee from domestic violence."}
{"text": "Proof of recovery vs PCR/antigen test to re-enter U.S"}
{"text": "Looking for suggestions for a good, romantic, 2 or 3 night getaway!"}
{"text": "I traveled to England for the first time a few years ago"}
{"text": "Is Marrakech safe for solo female travelers? (19F)"}
{"text": "Do menstrual cup cleansers have to follow the TSA liquids rule?"}
{"text": "Urgent- Cancun with no passport"}
{"text": "Domestic Travel in Argentina?"}
{"text": "Medieval mining town of Goslar, Germany. UNESCO World Culture Heritage Site."}
{"text": "Requirements for entry to Mexico"}
{"text": "[Uk] Looking for family destination that isn't Spain, Portugal or Turkey"}
{"text": "Any experience traveling with a pet (NOT an ESA or SA) on Spirit?"}
{"text": "Night buses/ferry worth it?"}
{"text": "How do I get over the fear of travel?"}
{"text": "Travel to Dallas"}
{"text": "Expedited passport renewal"}
{"text": "Nashville for non-country music fans"}
{"text": "After getting my Mobile boarding pass, can I also get a Physical boarding pass at the Airport?"}
{"text": "How do you balance travel and home life?"}
{"text": "PNW roadtrip - May/June"}
{"text": "I have a holiday booked to Netherlands in July, do you reckon this will go ahead? (From the UK)"}
{"text": "Missing Thailand 🇹🇭"}
{"text": "Should I go to Hawaii or Disney World?"}
{"text": "Where to book a flight in Europe for July-Aug 2021 with highest chance of being able to actually go."}
{"text": "Where can I buy a International SIM card?"}
{"text": "Where are some good spots to go snorkeling that can be walked/hiked to in Biscayne National park?"}
{"text": "Is Rio De Janeiro too dangerous for a solo trip?"}
{"text": "Barcelona, October 2018. My first international trip!"}
{"text": "Rome, Italy In October of 2018. Can’t wait to go back once this is all over."}
{"text": "Vieques, PR. Home of the black sand beach &amp; wild free roaming horses. I went 2 years in a row. Skipped 2020 due to covid but hoping to return winter of 2021 :)"}
{"text": "Rick Steves: \"Here I am, heading off to Europe the day after high school graduation in 1973 — with a budget of $3 a day, a ten-week Eurail pass in my pocket, and the biggest backpack I could find, jam-packed. I came home with no money, a malnourished body, and an enduring love of Europe.\""}
{"text": "Traveled to Portland, Oregon U.S. These are photos I took at the Japanese Tea Garden. It was gorgeous there!"}
{"text": "How to get ahold of Turkish Airlines for open ticket change?"}
{"text": "Opinions on traveling to the USA this summer"}
{"text": "Fastest way to get in Skopje?"}
{"text": "Elote"}
{"text": "Multiple different flight changes, from different airlines. Is this normal? What can I do? Cleveland Ohio to West Coast Florida."}
{"text": "Is this the place to ask a travel question? I need to cancel my flight, but the travel insurance is saying they won't refund because my son's suicide attempt is a \"mental disorder\" and they won't cover it"}
{"text": "Hot springs hotels/B&amp;Bs/etc. on the US east coast?"}
{"text": "Every city (or location) I've been (as I can remember) in order. Periodic table style. Opinions?"}
{"text": "Just booked my first solo trip to California"}
{"text": "Crossed off the first thing I ever put on my bucket list. This is the Redwoods part of my Seattle to LA coastline journey."}
{"text": "Tennessee Treasures"}
{"text": "Need rec for trip in Utah/NV/Cali area:"}
{"text": "Honeymoon location help"}
{"text": "Hagia Sophia, Istanbul (daytime long exposure shot)"}
{"text": "Is travel still worth it compared to Pre 2000s travel?"}
{"text": "Layover questions. Trying to take a trip to Skopje from The United States"}
{"text": "Mauritania train ride"}
{"text": "Will this be an issue when renting a car?"}
{"text": "Baja california - should I go here or choose somewhere else?"}
{"text": "I'm Traveling to South Africa in July 2021. Any Advice for Safety and Things to Do?"}
{"text": "Alaskan Cruise"}
{"text": "Peru travel planning—hit me with your recs!"}
{"text": "Leaving your heart in another city"}
{"text": "Nouvelair baggage price help!!"}
{"text": "Where to stay and not need to drive alot in southern california?"}
{"text": "Where to go next..."}
{"text": "what are hostels like right now? march 2021"}
{"text": "Baby on airplane? Tips?"}
{"text": "What's the fastest airport wifi you've ever used, and where?"}
{"text": "A good guide"}
{"text": "safe to travel to egypt now vs. waiting for march 2022?"}
{"text": "Kraków, Poland. One of my favorite European cities. Architecture is stunning."}
{"text": "Castelo dos Mouros, Sintra, Portugal 2019 [OC]"}
{"text": "For those who have been to India, but are not ethnically Indian/South Asian or white, how was your experience in the country? How did locals treat you?"}
{"text": "Red Rock Canyon near Las Vegas 2020, and A Dried Lake Bed"}
{"text": "Few pics from my trip to Palawan, Philippines"}
{"text": "3 favourite places and why?"}
{"text": "2013 visit to the Kush Pyramids at Meroe, Sudan"}
{"text": "Best Travel Podcast?"}
{"text": "What are some things I can do, to ensure that I’ll be able to travel in my life?"}
{"text": "A few questions about transportation on our first trip to Greek Islands"}
{"text": "Delaying Travel Goals?"}
{"text": "Third wheel vacation with bf's brother?"}
{"text": "Entry stamps in Quebec?"}
{"text": "Bolivia eVISA - Where?"}
{"text": "Can I get my travel insurance claim fully reimbursed?"}
{"text": "Can I travel to the UK with 3 phones(including an almost brand new iPhone 11)?"}
{"text": "Best tropical island vacations?"}
{"text": "Visiting the Smoky Mountains! How do we choose a route?"}
{"text": "PERU 1st time July 2021"}
{"text": "Ibla Siciliy stunning medieval town built between two gorges approached by a narrow gap of land."}
{"text": "Best resort in Mexico for hermits?"}
{"text": "Would taking a vacation to Montego Bay, Jamaica by myself at 21 be a safe idea?"}
{"text": "Does NEXUS include SENTRI?"}
{"text": "Question about Colognes on carry on"}
{"text": "Aruba, Renaissance Island and Arikok National Park"}
{"text": "UK based here, will flight prices rise or deflate over the coming months?"}
{"text": "Suggestions for my trip?"}
{"text": "Wahington state- Whales!"}
{"text": "Thailand, February 2020"}
{"text": "A little part of Colombian landscapes, I highly recommend everyone in here to take a plane and visit this awesome country. Places on photos: Guatavita, Cundinamarca - Castilla, Meta"}
{"text": "Rolling fog by Mt. Bromo, Indonesia at dawn"}
{"text": "First time flying, have stupid questions"}
{"text": "Cheapcaribbean seems to be playings some shady tricks with my credits."}
{"text": "Best Wifi Puck and Data Plan for Saudi Arabia."}
{"text": "Thailand, December 2018"}
{"text": "Favorite Pictures From My Trip to Colorado"}
{"text": "My 20 Favorite Countries to Travel through"}
{"text": "Need advice on beach vacation for the end of our trip"}
{"text": "iPhone photos to travel map?"}
{"text": "Airbnb restriction on young users?"}
{"text": "Egypt &amp; Jordan 3 week itinerary - for anyone who's been, does this look good or am I missing anything?"}
{"text": "This sub needs more México. Todos necesitan más de México. Here’s some photos taken around the Yucatán!"}
{"text": "Question about cancellation policies (CANADA -&gt; GERMANY)"}
{"text": "Kasmir, India 2009. One from the amazing trip I ever had."}
{"text": "2-3 days in the Oregon coast in June"}
{"text": "Morocco travel as a solo female as a part of an organized group tour: what are people's experiences?"}
{"text": "How long would it take to go to all 50 states by car?"}
{"text": "Honeymoon to Jamaica - I have a mirrorless camera and GoPro (and phone). Do I bring the GoPro or the mirrorless?"}
{"text": "Beautiful sunny day at Lustica Bay, Montenegro. Post was taken yesterday during our walking tour trough this beautiful complex."}
{"text": "Bringing gifts to the UK from US"}
{"text": "Discount Luxury Resorts"}
{"text": "Took a trip out to Cancun."}
{"text": "Travel website glitches while trying to book a trip"}
{"text": "Mt Kilimanjaro/Serengeti"}
{"text": "BritRail Pass GB Reviews?"}
{"text": "Travelling to italy and Zakhyntos."}
{"text": "Question about Canadian university student looking to work in Asia this summer"}
{"text": "Could you help me plan my honeymoon to Miami and Florida Keys?"}
{"text": "Want to travel to Colorado for National Forests"}
{"text": "What city do you love that most people wouldn't think of visiting/liking?"}
{"text": "4 month SE Asia Trip"}
{"text": "Alternate Europe Itinerary - Italy to Budapest - looking for opinions"}
{"text": "Just a couple pics from a summer trip out to the Adirondack’s. This is the Mount Colden hike specifically. Would recommend to everyone and has options to make the hike harder or easier!"}
{"text": "Is Roseorito safe ?"}
{"text": "Global Entry w/ old restraining order?"}
{"text": "“Off Season” in South Dakota has been the best animal viewing trip I’ve ever taken! 9 days spent in the Black Hills and especially in Custer State Park!"}
{"text": "The last trip I had before COVID hit (Namibia + Botswana)"}
{"text": "Paris vs Lisbon: Which city is better for a week long vacation?"}
{"text": "What happens to my EU citizenship if i travel with another passport"}
{"text": "Baby Moon Trip, Aruba or Saint Martin?"}
{"text": "Our life changing trip to Mexico in February 2019. We all know what happened after that..."}
{"text": "Planning to travel to Turkey 🇹🇷"}
{"text": "Do you like to read about the history or 'interesting facts' about a place before travelling?"}
{"text": "Avianca made multiple charges to my card for a single reservation."}
{"text": "I lived in Bhutan for 3 months and got to travel around a bit. Here's some of my favorite shots"}
{"text": "Road trip in southern oregon and northern california"}
{"text": "Ticketing in Progress"}
{"text": "Egypt-Jordan-Israel trip/itinerary advise"}
{"text": "Its Almost Time"}
{"text": "Family making me feel crazy for wanting to move a trip..am I being irrational?"}
{"text": "How often did you travel pre-pandemic and has the pandemic has changed your perception of travel?"}
{"text": "Syria, 10 years ago. Sorry for the terrible pic quality."}
{"text": "Honeymoon in Portugal - Summer 2022"}
{"text": "A few pics from my trip to Thailand right as COVID hit. Almost got stuck there but it wouldn’t have been too bad."}
{"text": "long term travel advice"}
{"text": "Decent waves in Cabo"}
{"text": "While we wait - Two decades of my own travel highlights, many of the less obvious kind."}
{"text": "I spent a week in Puerto Rico - today I depart. I photograph with a professional camera, here are my photographs."}
{"text": "Points of Interest on way to Rock &amp; Roll Hall of Fame"}
{"text": "Emirates and COPA codeshare flight - COPA App says payment required?"}
{"text": "Travelling through Scotland with dogs"}
{"text": "Eastern Turkey - drastic landscapes, Georgian churches, ancient ruins... Such an interesting and diverse place to visit."}
{"text": "French Polynesia - November 2019. The islands of Tahiti, Raiatea, Bora Bora, Moorea"}
{"text": "Our amazing trip to Gotland, Sweden situated on an island in the Baltic Sea."}
{"text": "Where would you travel if you knew you would be locked down for 1+ years?"}
{"text": "Solo Travel advice"}
{"text": "Do you document your travels?"}
{"text": "Which country do you really want to see but question the safety of going?"}
{"text": "Heading to Barcelona spring 2022 - where would we be able to pick up a smallish cooler for car travel?"}
{"text": "My last pre-COVID trip - Portugal, Spain, and France"}
{"text": "Ningde, China - almost 2 years ago"}
{"text": "What's a good Caribbean island for beginners?"}
{"text": "What to do with my bag?"}
{"text": "Preparing for Cancun"}
{"text": "What is the best age range for a year-long, round-the-world trip with children?"}
{"text": "Where else in the world is similar to Île d'Orléans in Quebec?"}
{"text": "Sulcata tortoise travel"}
{"text": "How are the OTAs able to sell before the airline? Should I buy now or wait? Flying to Dubai."}
{"text": "Tips for locations in Austin, TX"}
{"text": "Ait Ben Haddou, Morocco. March 2019."}
{"text": "Got to go to the Big Island of Hawaii last week. Nice to do some travelling again."}
{"text": "Spirit Airlines Boycott"}
{"text": "Separate Ticket Transit without VISA - Anyone Denied boarding?"}
{"text": "Returning to the USA without a passport and carrying two gaming consoles, can I cross back?"}
{"text": "Lanzarote, Canary Islands, February 2021"}
{"text": "Nervous about flying"}
{"text": "A budget friendly foreign destination for couples from India"}
{"text": "The only place on earth where two world heritage areas meet- oldest rainforest in the world and the Great Barrier Reef at Cape Tribulation. Watch out for crocodiles, deadly jellyfish, the bird that kills and the most venomous snake in the world! Ironically so hot, you need to swim.... March 2021."}
{"text": "A year ago, my husband and I visited Indonesia on our honeymoon. This was by far the best trip of my life."}
{"text": "Warm Christmas Destinations With 1.5 Year Old"}
{"text": "Pictures from my family trip to the Smoky Mountains (August 2019)"}
{"text": "Some pictures from my trip to Japan (2018). From conveyor belt sushi (kaitenzushi) to pod hostels, it's a dream destination for solo travellers."}
{"text": "Interested in traveling to remote villages in China with a guide"}
{"text": "Yunnan China, really a great place to travel"}
{"text": "Favorite travel apps"}
{"text": "Romantic all inclusive resort getaway recommendations?"}
{"text": "16 Hours in Doha without Transit visa"}
{"text": "Best order (of countries/regions) to travel the world in a lifetime?"}
{"text": "Best place to purchase flights?"}
{"text": "Can 17 years olds travel from The US to Canada without legal guardians?"}
{"text": "Looking to plan my first out of US trip, what destination would best fit my criteria?"}
{"text": "Thoughts or recommendations for South &amp; Central America"}
{"text": "Help with German travel"}
{"text": "Transsibirean railway from moskow to bejing"}
{"text": "My 30th Birthday bucket list trip to New Zealand (2019). A magical place where you can horseback ride, trek a glacier and bathe in hot springs on one day then jump out of a plane, lounge on a beach and dive into history the next."}
{"text": "Best places to travel in south/Central America or Caribbean?"}
{"text": "Old San Juan Puerto Rico"}
{"text": "Seville 🇪🇸 2017 The cathedral where Christopher Columbus is buried and Plaza de Espana which is was used for Naboo in Starwars. Plus the Alcazar gardens where you can wonder around for hours."}
{"text": "Health Insurance Options when Traveling for Extended period"}
{"text": "What is meant by \"place of birth\" on the U.S. State Department's passport application website?"}
{"text": "Advice on Travelling Northern Territory (Aus) in June/July"}
{"text": "Rome, Italy 2020 literally empty 🤩"}
{"text": "Travel time from California to New York."}
{"text": "ESTA or B2 Visa for America? (I have a caution)"}
{"text": "Old city of Mdina, Malta - used as a filming location for Game of Thrones (as King's Landing)"}
{"text": "Italian Dolomites in early June. Perfect time of year to go imo - warm weather down in the valleys but the mountains are still snowy."}
{"text": "New Years in Mexico"}
{"text": "Maps (nerd warning)"}
{"text": "Luggage wrapping station at Pearson Airport Canada."}
{"text": "I didn’t know before this week’s camping trip that Oklahoma has mountains! We climbed to the top of Elk Mountain and had a great view of the surrounding area (with VERY strong winds)."}
{"text": "My Canadian first cousin was not allowed to enter USA in Frankfurt airport on his way from Lebanon. Why ?"}
{"text": "Frenchbee - any experience with this airline?"}
{"text": "Memoir : A trip to Nepal, 2019. Traversed from Kathmandu, the city of temples to the wilderness of Palpa."}
{"text": "International channels similar to NHK World?"}
{"text": "Japan gassho zukuri villages in Toyama, Gifu and Kyoto"}
{"text": "What would likely happen if I attempted to drive through Syria from Lebanon to Turkey?"}
{"text": "Are pets still currently allowed on flights?"}
{"text": "Group travelling with friends and family: how to plan and coordinate"}
{"text": "How long may I stand?"}
{"text": "What is the best place in Denver to get a rental car for a group of 18 year olds?"}
{"text": "Tracker for All Inclusive Resort packages?"}
{"text": "I Suck At Decisions. :( Which Hawaiian Islands Should I Visit?"}
{"text": "Just Backpacked Bright Angel Trail in The Grand Canyon. Highly recommend"}
{"text": "Is it worth it/advicable to travel to learn a folk wrestling style?"}
{"text": "Is Tuesday still the best day to book flights?"}
{"text": "3rd party travel agencies legitimacy"}
{"text": "Guarulhos (GRU) airport, Terminal 3, where is COPA check in desk?"}
{"text": "A misty, humid day to experience Rhine Falls in Switzerland. Some photos taken on the short Rhine Falls boat trip. (June 2018)"}
{"text": "4-wheel vs 8-wheel Check-In luggage"}
{"text": "Our beautiful trip to Costa Rica toured San Jose, Manuel Antonio, Jaco, and Arenal (December 2019)"}
{"text": "Weekend Trips Southern Canadian Rockies"}
{"text": "Last summer took a trip to Sequoia National Park and Yosemite. Gorgeous hikes and a must go if possible. Can’t wait to get out and travel again."}
{"text": "My Rushmore - for July 4th"}
{"text": "Best stops in the southwest U.S.?"}
{"text": "Costa Rica Adventure Tour Question"}
{"text": "Can I fly on my own from UK to US being 16 years old?"}
{"text": "spontaneous drive in Germany ..."}
{"text": "Where in the US can I visit to experience midtown/rural America?"}
{"text": "Since we can't travel much these days, thought I'd share with you my pictures from my last trip, to Tanzania, late 2019."}
{"text": "My past year in Western Canada"}
{"text": "Aboard the TranzAlpine Train crossing the Southern Alps from Greymouth to Christchurch. (November 2017)"}
{"text": "Vacation Store Miami"}
{"text": "Walking alongside what remains of the Berlin Wall"}
{"text": "Outdoor/Adventure Bachelor Trip Location in the Western US?"}
{"text": "Reminiscing on travel - Dubrovnik 2019"}
{"text": "Looking back at photos from my trip to Maine. Bored out of my mind, can’t wait till places start opening up again."}
{"text": "An incredible story from this morning, thought I’d share. Share any similar stories y’all have."}
{"text": "Another duo Italy itinerary"}
{"text": "Some friends and I went to the Western Mourne Mountains in Northern Ireland a couple years ago for our dissertation and I’d definitely recommend it to anyone looking for some good hiking and views!!"}
{"text": "Tips on finding locals that guide you through foreign countries?"}
{"text": "My turn to reminisce on prior trips: China 2018"}
{"text": "Don't use mytrip for your travel needs"}
{"text": "Last year I traveled around my home-country Finland and I took these pics during the summer. There is pictures of Helsinki, Karelia, Salo and one with Chewbacca himself!"}
{"text": "CUBA: With the phasing out of CUC is it still most practical to convert USD to Euro, then Euro to CUP?"}
{"text": "Pic from my 2018 solo trip to Iran. The Allahverdi Khan , popularly known as Si-o-se-pol , Bridge of thirty-three is the largest of the eleven historical bridges on the Zayanderud, the largest river of the Iranian Plateau, in Isfahan, Iran."}
{"text": "What are some things you wish would end once traveling ramps up again?"}
{"text": "Atlantic City Vacation tips"}
{"text": "Denver, CO - Where is the best place to stay for mountain biking, rafting and hiking?"}
{"text": "Travel TV recommendations?"}
{"text": "Would you buy a house abroad?"}
{"text": "Denver Airport Question"}
{"text": "My wife and I recently went hiking/driving in the Marin Headlands (CA). Cataract Falls Trail + the Pacific Ocean on the panoramic highway!"}
{"text": "Passport Damage Acceptable???"}
{"text": "Do you have experience with getting a fast loan while traveling?"}
{"text": "A trip to Cuba."}
{"text": "Is bringing electronic devices on a flight troublesome?"}
{"text": "Any advice for avoiding jet lag while flying east from USA to Asia?"}
{"text": "Here are some of my fridge magnets (that made it home) from the past few years of travelling."}
{"text": "Traveling before it's too late?"}
{"text": "Best things to do/you’ve done for layovers of 6+ hrs in cities you’ve never been to?"}
{"text": "Podcast — “How I Built This” feat. Rick Steves on his journey from a broke backpacker to America’s trusted travel source"}
{"text": "Pictures that highlight my train journey through Europe in 2019"}
{"text": "Call/Text Forward With Data Roaming Off?"}
{"text": "Your favorite \"different\" city? The kind of place that is so special and unique that when you enter it you feel in another world and you can say \"Toto I've got a feeling we're not in Kansas anymore\"?"}
{"text": "South USA travel destinations?"}
{"text": "How many days would this Utah trip take to cover all these places?"}
{"text": "Our lunch in Rome, circa 2016"}
{"text": "It's been a year since I took these pictures in barcelona"}
{"text": "Veijo Rönkkö’s statuepark near the Russian border in Parikkala, Finland!"}
{"text": "I’m over 50 and am wanting to travel safely a bit this summer. I’m considering Air B&amp;B’s but have never tried them. Looking for any advice!"}
{"text": "Does anyone else like to dress nice when travelling on their extended travels?"}
{"text": "Ecuador/Galapagos or Costa Rica/Amazon?"}
{"text": "FMM form for Mexico - options?"}
{"text": "Yeah, age is only a number. Does age change your travel mindset ... in what ways ?"}
{"text": "Got invited on my folks trip to the Emerald Island this coming Sept."}
{"text": "California route and advice"}
{"text": "Drinking Culture in Georgia (the country)"}
{"text": "Indian applying for a Schengen Visa from the UK - Need to go back to India for an emergency, but passport is stuck with my Schengen Visa Application"}
{"text": "Noob question about US passport renewal?"}
{"text": "Andalusia, Spain in Summer 2018"}
{"text": "French language"}
{"text": "How long does it take to clear all formalities at Istanbul Airport?"}
{"text": "Does anyone know a good way to contact spirit these days?"}
{"text": "How to book a trip on a classic wooden fully rigged ship?"}
{"text": "Anyone else missing travel? Please share what travel means to you."}
{"text": "How do you deal with Two Factor Authentication?"}
{"text": "Took an impromptu roadtrip to Texas last week, had such a great time and got to see so many cool things!"}
{"text": "Can I get a visa to live/work in Germany if I was arrested in the US but found not guilty?"}
{"text": "A few memories from Nepal"}
{"text": "The Maldives (Jan 2021) - Malé, Ukulas, and Sun Siyam"}
{"text": "What seats on planes tend to be the quietest?"}
{"text": "Should I opt for a longer layover in Warsaw?"}
{"text": "Need location recommendations for travel with new girl...."}
{"text": "Best places for Northern Lights - Norway/Sweden 🇳🇴🇸🇪"}
{"text": "Recommendations for a stateside town on the Great Lakes that is walkable with a great restaurant scene"}
{"text": "In your words, what was it like traveling for the first time?"}
{"text": "Having a hard time finding a pet carrier that will be allowed as carry on for flights"}
{"text": "Help Plan My MEXICO Trip!"}
{"text": "Is China's SCS going to affect me?"}
{"text": "Temples of Angkor in Cambodia (last pre-pandemic trip, January 2020)"}
{"text": "Santorini Island - September 2020"}
{"text": "Rental Car in U.S. for 3+ Weeks"}
{"text": "Anyone tried \"Getaway\"??"}
{"text": "Jordan Feb 2020"}
{"text": "Canadian Work Permit - Police check from multiple countries"}
{"text": "Traveling advice"}
{"text": "What makes a remarkable trip for you?"}
{"text": "Squatting toilets as a woman"}
{"text": "Travel insurance access to personal information in the event of a claim"}
{"text": "Trip to the middle Rhine, Germany, between first and second lockdown"}
{"text": "Travel to USA after a name change"}
{"text": "A random selection of shots from my Vietnam &amp; Cambodia trip in 2018."}
{"text": "Some shots from my travels in Bali - March 2019"}
{"text": "When was your first solo travel?"}
{"text": "What’s a better cheaper destination Zihuatanejo, Vallarta, or Mazatlan"}
{"text": "Took a little roadie through Georgia and Azerbaijan with a couple friends back in 2019... these pics are helping me through my travel hiatus. Can’t say enough good things about Georgia and would go back in a heartbeat!"}
{"text": "10 days in the PNW itinerary help?"}
{"text": "Going to Tampa for four days any advice?"}
{"text": "Some colorful photos from my quarantine trip to Turkey in 2020"}
{"text": "Lost passport appointment"}
{"text": "Is november a good time to visit Philippines/Vietnam/Indonesia?"}
{"text": "The Gambia. Starting to explore the African continent from the smallest country (2019)."}
{"text": "Travel Blues made me relive my Japan roadtrip again (2019). Here are some of my favorite stops I did."}
{"text": "Places to visit along the west of Scotland?"}
{"text": "South Africa in early June"}
{"text": "Transportation for under 25s?"}
{"text": "When I visited Berlin, I made a daytrip to Potsdam. That day marked my travel day with the most walking, at 39,910 steps. (2017)"}
{"text": "Champions League - Impossible dream?"}
{"text": "Flying with Toddlers"}
{"text": "One year ago, I returned from 5 months of solo travel due to the start of the pandemic. Across 23 countries, I made some of the best memories of my life, seeing incredible places and meeting even better people. Figured I would share some of my favorite pictures from that trip!"}
{"text": "Best time to travel to Yellowstone?"}
{"text": "is there a travel planning app/website that will let me pin locations as a visual itinerary?"}
{"text": "Smokey Mountain Cabins?"}
{"text": "Dec 19’ Around the world Nonrev trip!"}
{"text": "Want to visit LA this weekend-good idea?"}
{"text": "Question about bag carry on size"}
{"text": "Random shots near Kotor, Montenegro (April 2018)"}
{"text": "The pictures here look really nice. What do you guys take them with?"}
{"text": "Hey guys! I was hoping I could get some advice. I honestly don’t know what else to do at this point. TDLR I’m being scammed by an airline for extra money"}
{"text": "Advice for a first-time international traveler?"}
{"text": "Beach with kids next week"}
{"text": "SnapTravel warning."}
{"text": "Need help picking a trip"}
{"text": "taking a travel guitar on American Airlines"}
{"text": "Need suggestions for LA to Grand Canyon, Utah, Vegas and back."}
{"text": "Help! ID for TSA check point."}
{"text": "Solo Mexico Recommendations - Beach/Authentic"}
{"text": "Is Southeast Asia still a \"off the beaten path\" destination?"}
{"text": "Quitting job to travel long term in your 30s?"}
{"text": "Travelling to Southeast Asia then moving on to AUS to hopefully work. Tips, Tricks and General Discussion to help?"}
{"text": "Transportation options"}
{"text": "When can you apply for a travel Visa again?"}
{"text": "Would TSA have a problem if I have a bag full of electronics?"}
{"text": "Paris vs Rome: Which city is better for a week long vacation?"}
{"text": "My 2018 southwest US \"Road Trip\" of a lifetime."}
{"text": "Viking Historical Vacation?"}
{"text": "Recommendation for destination for all boys trip!"}
{"text": "Best website to rent a cabin for around 15 people"}
{"text": "6 adults, $20k budget, options?"}
{"text": "First time travelling to the US (2022)"}
{"text": "Looking to trip around east coast looking for good tours of brewery’s or vineyards."}
{"text": "Norwegian Airways - no more flights from USA"}
{"text": "[OC] Nearly a full year being home from my 7 month trip around the world with my fiancée. 19 countries in total. Got home to the UK a week before lockdown.. So lucky to have done it when we did and have the beautiful photos to share with you all!"}
{"text": "Seeking opinions/advice on choosing where to travel for my first big international trip"}
{"text": "Masks at beaches?"}
{"text": "Do I need to return my US passport card with passport book renewal?"}
{"text": "Rider share vs Twisted road which is better for you those renting motorcycles out on the run?"}
{"text": "Can I board the plane without my ID?"}
{"text": "Outer Banks (Nags Head or Corolla) NC vs Put-in-Bay OH"}
{"text": "Paris bound!!"}
{"text": "Do you get bored of seeing churches, temples, castles etc. When travelling?"}
{"text": "2 days national park recommendations - end of March"}
{"text": "A panorama that I took during a trip to Hong Kong (July 2018)"}
{"text": "Whats a realistic budget for two students to spend a month in japan?"}
{"text": "Spain - Two Week Itinerary"}
{"text": "Solo travel to the Northwest US (25M)"}
{"text": "I’m getting a refund from an airline, but I booked through Cheap-o-air and the card I used is not valid anymore. Should I worry?"}
{"text": "La Alhambra in Granada, Spain"}
{"text": "Travel exchange ?"}
{"text": "[OC] The Meteora, UNESCO World Heritage Site, Greece, 10 years ago"}
{"text": "Would TSA find out if I had whiskey in my checked baggage if I’m under 21?"}
{"text": "Anyone have any hot springs in the United States to recommend?"}
{"text": "San Marino may be small, but the views from the 1700-year-old city-state's walls are hard to beat (solo trip February 2016)"}
{"text": "Travel solo at lease once in your life"}
{"text": "Hey travellers!, Do you guys know or work in a profession that requires a lot of travelling? Please comment below, would help me and others a lot!!"}
{"text": "One of the great things to do in Venice is a sunset-time boat ride; even on the vaporetto, the public waterbus, this was always a magical experience."}
{"text": "I'm going to Korea and need to ship luggage"}
{"text": "Where can you buy in-flight meals?"}
{"text": "Health insurance for people already overseas from USA?"}
{"text": "Best airline for large baggage allowance(Narita to SFO)"}
{"text": "Portugal in April"}
{"text": "Questions about American travelling to Europe"}
{"text": "One-way ticket to Galápagos before the rest of South America?"}
{"text": "Sequoia National Park this weekend!"}
{"text": "Road trip across the US"}
{"text": "Places on your travel list? I thought it would be fun to compare!"}
{"text": "Mesi bridge in Shkodër, Albania"}
{"text": "Mexico Itinerary- advice please!"}
{"text": "What is the process for flying a pig pet domestically and internationally, and are there weight limitations?"}
{"text": "Vegas - Zion NP - Bryce NP - Antelope Canyon,AZ"}
{"text": "How are the waves in Cabo vs Cancun (pacific vs gulf)"}
{"text": "What do you do with your travel photos？"}
{"text": "32/M Biracial American seeking advice on Eastern Europe"}
{"text": "Hotel/Hostel similar to Meininger Hotels in Barcelona?"}
{"text": "Worldwide events/Celebrations in 2021 worth planning a trip around"}
{"text": "Which bank platform would you suggest for a traveller?"}
{"text": "Christmas markets; Strasbourg, France (2019)"}
{"text": "Friend wants to visit USA."}
{"text": "Punta Arenas and Chilean Tierra del Fuego — Five years ago on a year long road trip"}
{"text": "Best Mexico destination in September? Avoiding bad weather?"}
{"text": "Need advice for creating travel blog"}
{"text": "How to find requirements for driving with North American license plates across Europe?"}
{"text": "I visited North Korea recently, these are some of the photos."}
{"text": "Looking for a weekend away from Ohio"}
{"text": "Hey there! Planning a trip to either Puerto Rico or St Thomas from NY in a few weeks"}
{"text": "Places to visit near the Netherlands (Germany/Belgium/France?)"}
{"text": "How to get to Wallis (Wallis and Futuna)"}
{"text": "1-month road trip on the western side of the US."}
{"text": "Breathtaking: northern Italy, 2014. Flew into Venice and out of Milan; visited Verona, Salorno, Bolzano, Parma, &amp; more by train."}
{"text": "Stylish yet Tough/Safe Checkable Luggage"}
{"text": "The Neretva from Mostar's Old Bridge. Dazzling sun rays and naturally turquoise water."}
{"text": "Travel Budget App"}
{"text": "Is there a list of hotels with translucent wall showers in the USA?"}
{"text": "How to get a group of strangers familiar with each other before future group trip"}
{"text": "What are some good apps to use to make international friends?"}
{"text": "Badlands National Park"}
{"text": "People that hated/disliked Japan. Why?"}
{"text": "Famous flower patios in Córdoba, Spain"}
{"text": "Travelling to kish island"}
{"text": "Did I overpay for my tickets...."}
{"text": "How much should I save for a trip to Tokyo next year?"}
{"text": "Airline changed my flight itinerary to have a layover 9 hours longer than what I had booked (EU)"}
{"text": "Quitting my corporate job and moving to the beach"}
{"text": "How do you travel with two passports?"}
{"text": "Being a female in a shared room"}
{"text": "Wife and I looking to spend the first week in May in South Beach Miami. Where to stay/what to do"}
{"text": "Are the beaches swimmable in Punta Cana, DR?"}
{"text": "Walking around Zealand, Denmark, Season 2 - 2020"}
{"text": "Egypt Nov 2021"}
{"text": "Does my Nicaragua itinerary make sense?"}
{"text": "Booked flight through travel site, confirmation dates from the site do not match the Airline's website"}
{"text": "Babymoon travel suggestions"}
{"text": "Most beautiful place I've been: Alaska, Feb 2020"}
{"text": "Keeping my job and also moving to the beach"}
{"text": "I need help finding a luggage set for my trip in 3 weeks!"}
{"text": "Where are some good places to teach English for someone who wants to learn the skills of living in a traditional rural community?"}
{"text": "Flagstaff, AR - for 3 days"}
{"text": "Trip to Tilum QR Question"}
{"text": "What countries/cities were nothing like what you expected?"}
{"text": "I want to know how does travelling with train from country to country works?"}
{"text": "Best place to stay in Cabo San Lucas with a group of people"}
{"text": "Prepaid debit card as a bank statement"}
{"text": "Citizenship certificate was lost in the mail by Passport agency"}
{"text": "Short Duration Trip to Mexico"}
{"text": "Itinerary Check: New England in June"}
{"text": "Us Passport help"}
{"text": "Moving back home to India from the USA- Forex advice"}
{"text": "Septic tanks or compost toilet? What would travellers prefer?"}
{"text": "Solo drive to Alaska"}
{"text": "cheap short duration trip outside the US?"}
{"text": "As we had to put traveling on pause, I did the recap of my travel highlights from the past 5 years to keep the spirits up."}
{"text": "Playa Del Carmen or Tulum"}
{"text": "Im a US citizen, I went to the Dominican Republic for vacation to visit my family and stayed for over 15 days. Will I be charged when re-entering the USA?"}
{"text": "For anyone thinking of France in the next six months"}
{"text": "My son (7) and I spent the summer road tripping around Norway. We started in Stavanger and followed the road south, west and then north to Alesund. Driving back to Stavanger down through the western fjords was just breathtaking!"}
{"text": "Any advice for a young woman traveling alone ?"}
{"text": "My last trip before the pandemic hit. Wild kangaroos visited the camping ground at night and also, cane toad. A very interesting trip indeed. (Chillagoe, Australia : Sep 19)"}
{"text": "how strict is United on personal items vs carry on?"}
{"text": "It might be different based on which part of the world you are but, should tourists speak local language or English is just universal for (minor/major) communication?"}
{"text": "Is it difficult to travel without a car in Cairns?"}
{"text": "Best places to hike in the US without camping?"}
{"text": "Issyk Lake, Almaty region (Kazakhstan). Last summer. The lake change color depending on weather."}
{"text": "Frontier Airlines miles redemption??"}
{"text": "Advice on teaching / working with kids abroad"}
{"text": "The view from Lookout Mountain, CO"}
{"text": "Egypt Visa on Arrival for UK ILR holder"}
{"text": "Kansas City, Missouri. An amazing and lively city that is super fun to walk around. On the outskirts you can find some amazing food and some beautiful buildings. Definitely recommend staying there!"}
{"text": "Western Canada RV Trip Itinerary Advice"}
{"text": "Flying out of UK. Is proof of \"essential travel\" needed?"}
{"text": "Road trip from Europe to Asia"}
{"text": "Enjoyed Tuscany, looking for similar places."}
{"text": "For all of you who think of visiting italy in 2021"}
{"text": "Lancaster, England - Exploring close to home."}
{"text": "Daydreaming about Hallstatt, Austria (photos taken October 2019)"}
{"text": "Canadian visiting the US--possible to prescribe emergency medication in the US with a Canadian doctor?"}
{"text": "Chicago O’Hare parking"}
{"text": "Advice on traveling to Asia"}
{"text": "Nice and Menton, France. February 2021, a day before the announcement of the weekend lockdown."}
{"text": "what’s something you wish you knew on your first trip?"}
{"text": "Beautiful and diverse Tenerife, Canary Islands"}
{"text": "Kundasang, Sabah, East Malaysia. My first time of being above the clouds."}
{"text": "Question about traveling with expired passport within the US"}
{"text": "Help with obtaining a Russian Visa"}
{"text": "What are everyone's thoughts in visiting NYC right now or the near term?"}
{"text": "trans-atlantic flight with a toy poodle (8.8 lbs, two years old)"}
{"text": "Suggested itinerary for family of 5 in Spain (including Barcelona)"}
{"text": "Location Advice for a Trip to Europe"}
{"text": "Volunteering Trips"}
{"text": "Your ideal two week SEA itinerary?"}
{"text": "Altitude Sickness Question?"}
{"text": "PayPal not an option anymore?"}
{"text": "Door Peninsula Wisconsin"}
{"text": "Sahara Desert traveling"}
{"text": "(Peru) How to travel with this itinerary"}
{"text": "Five days Split Croatia —&gt; Athens"}
{"text": "Traveling through Istanbul international airport"}
{"text": "Backpacking the W in Torres del Paine National Park, Chile — Five years ago on a year long road trip"}
{"text": "What's your thoughts on Belgium? Let's discuss."}
{"text": "Can you cross from the US to Mexico with a provisional license?"}
{"text": "Arkansas camping recommendations"}
{"text": "Any estimation for how much I need to save for a 10Day trip to Paris this summer?"}
{"text": "Best places to travel in mid April? Looking for locations in U.S."}
{"text": "Having issues with my passport photo please help"}
{"text": "3 days in Moab, UT, looking for advice!"}
{"text": "A few questions about a future trip to France..."}
{"text": "Ski camps for adults?"}
{"text": "Glacier National Park or Idaho with Kids?"}
{"text": "Best National Park(s) and Advice for Solo Travel to for 4-6 Days?"}
{"text": "Ideas for Mom/Daughter Trip"}
{"text": "Starting law school in the fall, really wanted to go to Europe for a month late-July to mid-Aug but likely not going to happen. Any ideas on what to do?"}
{"text": "Sukothai, Thailand 700+ year old temple. Pics taken yesterday. The entire city is filled with ancient ruins like this practically everywhere you look."}
{"text": "Best credit card for international travel?"}
{"text": "Central European and Eastern European City Suggestions?"}
{"text": "Which temple could or can I go to live at a Buddhist temple. I’m a native English speaker age 31 male healthy enough to do many chores or what ever is needed around and within the temple. I’m currently in Vietnam (south)."}
{"text": "What are some of the most underrated / forgotten places to visit in America"}
{"text": "Pictures from Pripyat’ and Chernobyl’ in Ukraine from a trip I took in July 2018."}
{"text": "Japan Trip January 2020 - Tokyo, Nikko, Kyoto, Nara, Osaka"}
{"text": "best (eu/german) sites to rent a sommer house in croatia"}
{"text": "I’m getting married (but I need your help)"}
{"text": "First Time LA Trip!"}
{"text": "Prague In the Fog Early This Morning"}
{"text": "Driving on the left."}
{"text": "Where are you guy's traveling this year?"}
{"text": "A Trip to Brazil with my Brother - Advice?"}
{"text": "Puglia at the end of April 2022"}
{"text": "Has anyone gone to Cuba recently from America?"}
{"text": "Renting a Car as a 23yr old?"}
{"text": "Does any hotel chain let you accumulate points when you book through a website like Expedia or Hotels.com?"}
{"text": "Is traveling helps with depression ?"}
{"text": "Hydra, Greece. Pictures taken in 2019"}
{"text": "Cordoba Patio Festival in Spain. Each year in May, residents open up their patios for the public to view their unique displays."}
{"text": "Graduation Trip to Cancún, Need Advice!"}
{"text": "Finally finished to sort the photos from our last brothers trip in the Dolomiti (Italy - is it still necessary to precise?), this region is just incredible."}
{"text": "Dharmshala, India. January 2021."}
{"text": "Kotor, Montenegro (2019) July"}
{"text": "Iguazu Falls along the Argentina and Brazil border are really something to behold."}
{"text": "Hue Vietnam. Such a beautiful city that doesn’t seem to get as much attention as other places in Vietnam."}
{"text": "Driving from cleveland OH to portland OR next week- quickest/safest route"}
{"text": "Beautiful Island of Madeira, Portugal"}
{"text": "Please help! Ryanair help needed"}
{"text": "Albanian Riviera?"}
{"text": "Travelling with a partner?"}
{"text": "Monument Valley &amp; Antelope Canyon Reservation Questions"}
{"text": "Travel with new phone"}
{"text": "Unexpected trip! Miami, FL or Las Vegas, NV"}
{"text": "On the one-year anniversary of being stuck at home, here's me, reminiscing about the place where God rested on the 7th day. Alberta, Canada."}
{"text": "Question about traveling in a group."}
{"text": "Scared of Dogs--Travel suggestions in Africa/South Asia/Latin America"}
{"text": "Why aren't lake beaches included in best beach lists?"}
{"text": "Traveling for a new city for a day"}
{"text": "Driving uk to Asia"}
{"text": "3-4 Week Road Trip to US West National Parks Advice?"}
{"text": "Along the Ancient Silk Road in Western China"}
{"text": "Riyadh to Jerusalem"}
{"text": "I was hitchhiking for 3 months from Ecuador to Antarctica back in 2016, some pictures below"}
{"text": "How full are domestic flights in the US at the moment?"}
{"text": "27/F Traveling to SIWA advice please!"}
{"text": "Travel to turkey for family with children with a rental car"}
{"text": "Can I take a cardboard box as my luggage on a greyhound?"}
{"text": "Chase Sapphire Reserve - Trip Delay Insurance - Return Flight Cancelled to Texas during Winterpocolypse 2021"}
{"text": "Does Korean Air weigh Carry On luggages nowadays?"}
{"text": "Marrakech, Morocco (Feb 2020)"}
{"text": "Please Help Settle An Argument - Florida 2022"}
{"text": "How to Validate if \"Free\" travel trip is legit"}
{"text": "What US destination has the best weather in August?"}
{"text": "Long term travelers: How do you handle the guilt of leaving your parents behind?"}
{"text": "Anyone know anything about work exchange??"}
{"text": "The most scenic route from Paris to Switzerland?"}
{"text": "How to start travelling?"}
{"text": "Wanting to travel to Beirut"}
{"text": "The non-travel struggle is real."}
{"text": "First Time On A Plane"}
{"text": "Best way to come into contact with tour guides"}
{"text": "Schengen 90/180 days question"}
{"text": "Reminiscing on travel: The Netherlands - 2019"}
{"text": "Trip planning assistance."}
{"text": "Missing those marvellous moments.. Edinburgh, Scotland, 2019"}
{"text": "Just came back from one of the best weekends in my life. Russia. Permskii Krai. Polud. Minus 25 degrees"}
{"text": "Which cities in Europe would be considered AMAZING even though they aren't popular?"}
{"text": "Manatees"}
{"text": "Rye, England [Aug. 2020]"}
{"text": "Australia and New Zealand Campervan Rental Recommendations"}
{"text": "How do I fly on an airplane with my cat? Please help"}
{"text": "Summer 2021 or 2022 scuba diving trip"}
{"text": "Anyone know anything about renting AWD cars, specifically with Avis?"}
{"text": "Drone shots from my trip to northern Italy in 2019"}
{"text": "Two weeks in Japan 🇯🇵"}
{"text": "What are some destinations where you can rent a boat and explore?"}
{"text": "Arrowtown, New Zealand - quaint little town with stunning hiking trails. This one's the easy bit :)"}
{"text": "Monday Night Travel with Rick Steves - Insider's Rome with Francesca Caruso"}
{"text": "The smelting plant Františkova huta, Svk"}
{"text": "Does the flight number designate the type of aircraft?"}
{"text": "Hawaii January 2020, found myself missing the gorgeous island of Maui during all this ice and snow."}
{"text": "Wildlife voluntourism - going abroad - What to do?"}
{"text": "The beautiful island of Corsica, France (2014)"}
{"text": "New Orleans haunted and voodoo scene recommendations"}
{"text": "Are the Bolivian salt flats worth visiting twice at different times of the year?"}
{"text": "One day hiking trip in Calanques national park, France (Jan. 2020)"}
{"text": "A week in Hawaii, sharks, hikes, and parasailing."}
{"text": "Snowy Travels in New Zealand Story"}
{"text": "[Recommendation] What are your suggestions for countries that will thrill experienced and newbie travellers alike?"}
{"text": "Spend Holidays in the U.S with a remote U.S employer"}
{"text": "Southern Plantations"}
{"text": "Applied for US passport 4 weeks ago and they still have not received my application?"}
{"text": "Looking for an underrated spot for a week long trip in the western USA . Traveling at the end of March. Low budget preferable!"}
{"text": "Atacama Desert, Chile, 2017: the driest non-polar desert in the world. Stargazing was awesome."}
{"text": "All Inclusive Cabo Trip, Out of my Element"}
{"text": "Remembering my visit to Berlin in 2017"}
{"text": "West Africa"}
{"text": "Le Mort Homme, or Dead Man's Hill in Verdun. I went there with my brother in 2019 January."}
{"text": "Replacement for lost passport"}
{"text": "How many of you pick up your old travel journal and read?"}
{"text": "Where can I stay in Florida? Would like to be somewhere on a beach."}
{"text": "Looking for a place to stay for the summer without restrictions/lock down"}
{"text": "Recommendations for a trip to Southern Italy!"}
{"text": "Big Sur: 2017"}
{"text": "Passport Timelines"}
{"text": "I visited Antarctica recently, these are some of the photos."}
{"text": "traveling europe at 17"}
{"text": "Is it possible to enter Geneva for a few hours for a meeting and then return to France without getting a PCR test?"}
{"text": "Northern China trip suggestions? Stuck in China and looking to do an awesome trip with my time off in Summer. Here's my very rough itinerary."}
{"text": "Is Iran safe for French citizens? (other than the pandemic)"}
{"text": "Airline obese policies"}
{"text": "Any advice for a 23 year old tiny woman road tripping around most of America by herself? Details below"}
{"text": "Can I use my US disabled parking ID card as disability identification in the UK?"}
{"text": "Which airline is better?"}
{"text": "Looking for temporary (not travel) health insurance while visiting Canada for six months"}
{"text": "I went dog sledding in British Columbia the other weekend with a few friends. It had snowed in the days leading up to the trip, coating everything in a beautiful, fluffy powder. The dogs were playful; they had recently been fed and excited to run along the trails. It was a wonderful experience!"}
{"text": "What do you guys think about traveling during this pandemic?"}
{"text": "Perito Moreno Glacier in Los Glaciares National Park, Argentina — Five years ago on a year long road trip"}
{"text": "Travel to Canary Islands (Gran Canaria), is that a good idea ?"}
{"text": "How does local advice influence your trip planning/execution?"}
{"text": "Luggage advice from a Baggage Handler"}
{"text": "Why the huge price difference between flights to Moscow Russia and other European destinations?"}
{"text": "Kim Il Sung Square in Pyongyang, North Korea (with the 170-metre tall Tower of the Juche Ideology in the background)."}
{"text": "[OC] Wildlife spotting around Cape Breton Island, Nova Scotia (2018)"}
{"text": "San Marino 2021"}
{"text": "Where can I go near Miami, Florida that doesn't have large spring break crowds?"}
{"text": "Cruise, Japan trip, or Japan Cruise for babymoon?"}
{"text": "Black/BIPOC Friendly countries?"}
{"text": "Good eats off I-95?"}
{"text": "Is Roatán, Honduras Safe?"}
{"text": "Roadtrip to East-Canada with baby: SOS?"}
{"text": "View from the Brienzer Rothorn, Switzerland (August 2019)."}
{"text": "[Recommendations] Where to take my mom that's a little more off-the-beaten track"}
{"text": "Should I just plan for nearby cities and maybe neighboring states for trips this year?"}
{"text": "where in Russia to find \"soviet\" looking cities"}
{"text": "Northwest Ohio day trip"}
{"text": "Getting from Guatemala City to Antigua"}
{"text": "RTW in 1 Year"}
{"text": "I want to visit brazil in a year (i have duel citizenship) how should i go about this?"}
{"text": "Trying to find the best spot for a Caribbean trip in April! Please share your experiences / input!!"}
{"text": "Knoxville/Asheville to Great Smoky Mts."}
{"text": "Website for last minute weekend getaway?"}
{"text": "US passport expedited renewal"}
{"text": "Honeymoon to st. Lucia planning help."}
{"text": "Need travel recommendations like Cancun"}
{"text": "Crazy Lost Bag Journey - Need Some Help"}
{"text": "Expired US Passport"}
{"text": "What country has the best bacon?"}
{"text": "Lisbon, Portugal. Reminiscing over the food, weather, and the person whom I spent it with."}
{"text": "Any been to The Cook Islands?"}
{"text": "Some impression from Bavaria"}
{"text": "A Word of Warning: Avoid Rock Resorts/Vail Resorts Management Company"}
{"text": "Southbound through Patagonia on Argentina’s Ruta 40"}
{"text": "Edges of the Western World"}
{"text": "2019 was the year of traveling for me. Started with Dubai &amp; Abu Dhabi. January 2019."}
{"text": "Booking a car from kayak, Priceline, etc is it legit?"}
{"text": "A day in Strasbourg, France"}
{"text": "Honeymoon Suggestions"}
{"text": "Revisiting old photos and reliving the moments - this is Tsumago-juku, one of the villages along the ancient Nakasendō trail between Tokyo and Kyoto kept in a traditional style."}
{"text": "Glendalough, Co. Wicklow, Ireland (September 2020) My last weekend away before this current lockdown"}
{"text": "Semester Abroad in Thessaloniki vs Rome"}
{"text": "What quirks from other countries leave you baffled?"}
{"text": "Lost Passport as ID for Online Form?"}
{"text": "Sedona, AZ to the Grand Canyon (south rim)! HELP PLS"}
{"text": "Have you gone on a helicopter flight before while traveling?"}
{"text": "Getting My First Passport, Help Me Succeed!(First Time Traveler)"}
{"text": "Questions to ease my flight anxiety"}
{"text": "Is it possible to travel for the long term (years) with no visa?"}
{"text": "Internal Travelling Experience: Please Share"}
{"text": "Anyone in the US recently fly frontier?"}
{"text": "2-3 Week Trip Near a Beach"}
{"text": "Do you need capital to leave ukraine as tourist?"}
{"text": "Four week US trip: Looking for route advice."}
{"text": "Thinking to go to cancun in the summer ( after we got vaccinated) is this too much?"}
{"text": "Is Brazil a safe destination for solo travel?"}
{"text": "Istanbul, Turkey and the amazing splendors it holds."}
{"text": "Potential tropical vacation this summer"}
{"text": "Traveling from Denver to Winter-Park"}
{"text": "Any countries you won't return to due to negative experiences?"}
{"text": "Really enjoyed the hike during sunset —Mount Hua. Shaanxi, China"}
{"text": "One of my favorite parts of Colombia I visited by motorcycle: The Tatacoa Desert, Huila, Colombia"}
{"text": "Staying in Reykjavik Iceland (post COVID19)"}
{"text": "trying to bring a friend from the city hes in to mine, but he doesnt have any government id :/"}
{"text": "Planning a Trip to South of France (Provence) and flying in via Paris with my wife. I've been recommended to travel from West to East. Any tips,advice or guides on this sort of trip? Any places I've missed?"}
{"text": "Arizona"}
{"text": "Road trip from Philadelphia to Florida - looking for ideas"}
{"text": "Urgent/desperate- renting car without return travel, debit card only (thanks you!)"}
{"text": "U.S. Passport Renewal, Must be done by Mail?"}
{"text": "Please help me plan my trip from Florida to Costa Rica!"}
{"text": "Scotland 3 weeks Itinerary"}
{"text": "What are your favorite travel channels that focus on Latin America?"}
{"text": "How long will the embassy return my passport after my visa application decision is made?"}
{"text": "Favorite Travel/UrbEx/Hiking Youtubers?"}
{"text": "Does Hungary has something similar to UK OS maps? With land boundaries, forest types etc on it? If yes what it is called there?"}
{"text": "Are all inclusive holidays really cheaper than booking flights and accommodation separately?"}
{"text": "What were your worst vacation/travel experiences?"}
{"text": "I am wanting to travel to Europe this summer in search of solstice/midsummer type festivals, but I don't really know where to start researching. Any pointers?"}
{"text": "Question, what is the best rewards program for hotel/flights?"}
{"text": "What is your favorite trip you took last year?"}
{"text": "Could I get by ok in SE Asia with a severe soy allergy?"}
{"text": "United States Passport"}
{"text": "Joshua Tree, CA..... or “Joshua’s tree” as my mom calls it"}
{"text": "The cloud vally. when i decided go out with some friends in the high Atlas Mountains in Morocco. The entire small villages disappear at 7 a.m."}
{"text": "Travel vlogger recs to experience the local culture and history of China"}
{"text": "Mont Saint Michel - one of my favorite places I've visited."}
{"text": "Where is the best place to travel after it's back to normal? I have 5 ideas. Please let me know your thoughts if you have pointers?"}
{"text": "Father / Son train travel from Seattle to somewhere in Oregon this summer. Where should we visit?"}
{"text": "What's your experience with international health insurance?"}
{"text": "Need Help with 2022 Northern Italy Trip"}
{"text": "AirBnB Cancellation policy - anything that I am missing?"}
{"text": "Surprise daddy/daughter wildlife trip with my 12 yr old. The Pantanal vs Costa Rica vs Galapagos?"}
{"text": "US vs EU Airlines - any issues"}
{"text": "Planning a trip to Bocas Del Toro"}
{"text": "Summer with my “brother”!"}
{"text": "Two years ago, I was travelling around Mallorca..."}
{"text": "Spending 2 weeks in Doha or Bahrain"}
{"text": "How much it will cost me a day to go to Tanzania or Uganda to see animals in the wild ?"}
{"text": "The extreme sport of Couch Surfing."}
{"text": "I can’t believe this was in my backyard for years and I didn’t know it. We traveled locally to go kayaking. (Florida)"}
{"text": "From Portugal to Nepal by train?"}
{"text": "Winter weather makes me dream of Santorini/Greece"}
{"text": "Missing Life in Germany"}
{"text": "How long would it take to go through customs at George Bush Intercontinental Airport?"}
{"text": "Suggestions for a 10 day trip to Germany (and Brussels)"}
{"text": "Freedom to snorkel at the Riu Montego Bay?"}
{"text": "Are there any soccer fields in Bora Bora?"}
{"text": "[OC] Joshua Tree National Park - Hidden Valley Trail, November 2019"}
{"text": "Thailand"}
{"text": "Renting a car in the US (Florida) as a 23 year old foreigner?"}
{"text": "US Roadtrip Helps and Suggestions"}
{"text": "Any favorite all-inclusive in Puerto Vallarta?"}
{"text": "Thinking About a U.S. Roadtrip in an Old Car"}
{"text": "Thinking of going to Sumatra, Indonesia as a solo traveler"}
{"text": "My trip to Afghanistan in January 2021"}
{"text": "beware snaptravel"}
{"text": "Jingsanling section of the Great Wall near Beijing in 2018"}
{"text": "Things I saw people carrying on mopeds in SE Asia"}
{"text": "Has anyone rented from Turo, Get around, gig car, etc..what one do you prefer?"}
{"text": "Florence without the crowd"}
{"text": "Amtrak vs Grand Funk Railroad"}
{"text": "Bus lost my luggage, claims no responsibility. What are my options?"}
{"text": "Thining of making a solo travel trip to Switzerland and would like to see the smaller cities. What are the best ones to see and the best ways to get to them?"}
{"text": "Stats for r/travel showing impact of COVID-19 (from https://subredditstats.com/r/travel)"}
{"text": "Question about East Europe"}
{"text": "Travel to LA (Los Angeles)?"}
{"text": "Buying Gold In Nicaragua"}
{"text": "Traveling within the US/Canada on a budget with someone who is the polar opposite of you. Help!"}
{"text": "Solo Travel"}
{"text": "Visited Hamburg back in 2017. Seemingly overlooked by travelers, it has a modern elegance and beauty to it. Not pictured: herring and other fish dishes, as tasty as they were."}
{"text": "Inexpensive Car Rental SF to LV in April"}
{"text": "[OC] Sunrise to sunset in the Grand Canyon South during our 2018 Arizona-Utah road trip. Did the Canyon Vista mule ride and saw a herd of elk hanging around the Visitor Centre."}
{"text": "Vestmannaeyjar Island, Iceland. One of the highlights of my Iceland trip in 2017"}
{"text": "How to connect with a new place beyond \"tourism\"?"}
{"text": "Colorado: Boulder vs Glenwood Springs in August?"}
{"text": "Throwback to summer 2018 and my trip to China"}
{"text": "First time visiting Florida Itinerary Advice - Any tips on Traveling, Must Do, Nightlife, Disneyworld, Food/Restaurants, Hotels, etc?"}
{"text": "Reentry to Canada after DUI?"}
{"text": "Best website for flight planning and price range?"}
{"text": "Day hikes in Parque Patagonia, Chile — Five years ago on a year long road trip"}
{"text": "Air Canada—Not Worth It"}
{"text": "Travel related items for room decor"}
{"text": "Has anyone been to Antarctica? Worth it?"}
{"text": "Trying to find a 22x14x9 carry-on bag is seemingly impossible"}
{"text": "DEL-CDG-FRA-YYZ travel restrictions and Transit"}
{"text": "Qatar Airways Wi-Fi operability?"}
{"text": "Have you ever used a travel tour company? What was your experience like?"}
{"text": "Smart or stupid: drinking destination water before traveling"}
{"text": "How much planning should I be doing for a 1 year RTW trip?"}
{"text": "Help a first time cruiser out"}
{"text": "India, December 2019 (Part 1) - Mumbai, Goa, Hampi"}
{"text": "Air Canada still won’t refund me for flights I booked pre pandemic. Their only option is to use it for a credit on a non refundable flight. I’m moving to Europe in a few months and their credit is useless to me."}
{"text": "Which song always reminds you of a great travel memory?"}
{"text": "Beautiful Train trips through Europe"}
{"text": "Don’t know if drawings count but here goes - some quick sketches whilst walking / working in my city of Manchester since the turn of the year. Things (still) suck at the moment, but we’ve probably explored and appreciated home a bit more than usual 🐝"}
{"text": "USA locations with actual character"}
{"text": "In a really big pickle overseas. need help asap"}
{"text": "UK Standard Visa"}
{"text": "Planning a northern California solo trip"}
{"text": "Safest &amp; most scenic cities/towns to visit without blowing our budget? (In the US)"}
{"text": "Do I need an American visa waiver ?"}
{"text": "Kraków,Poland 2019. Loved this trip. Beautiful city and wonderful people!"}
{"text": "I have a free vacation certificate that can be used either in Grand Bahama or the Dominican Republic. Not sure what to chose. I need help from people who have been to either!"}
{"text": "Trouble finalizing scenic USA (northern California?) trip. Seeking help/ advice"}
{"text": "Philippines vs. Indonesia"}
{"text": "Skyscanner but for trains?"}
{"text": "US passport renewal form question"}
{"text": "Is Hampi still worth visiting in 2021?"}
{"text": "Disappearing"}
{"text": "Overstayed in Schengen 2 years ago, question about traveling again."}
{"text": "Visiting Tokyo in 2022/Space A flight"}
{"text": "Winter travel to the lovely Budapest city, a year ago"}
{"text": "Airport Steps/Help?"}
{"text": "Airmiles suddenly worthless"}
{"text": "Specific question about traveling through Europe"}
{"text": "I don't remember specifically but behind the right building, I think, is where Anne Boleyn was executed. I've always been fascinated by the history behind the Tower of London, so this visit was a treat."}
{"text": "A few pics from my solo Jordan (Petra + Wadi Rum) trip back in Jan 2020"}
{"text": "Travel with kids?"}
{"text": "Costa Rica Questions"}
{"text": "Driving around Durmitor National Park, Montenegro (Pre-Covid)"}
{"text": "Texas roadtrip: Bandera Marfa, Big Bed, Austin"}
{"text": "Switzerland 2021 hopefully"}
{"text": "Naminara Republic / South Korea"}
{"text": "How do you guys plan weather dependant activities during your travels?"}
{"text": "International Travel Pet Crate Suggestions"}
{"text": "Car rental vs Ride-share (uber) in Croatia (2022 trip advice)"}
{"text": "Thinking about a trip to europe this summer but as a student I wouldn't have a huge budget. Any suggestions?"}
{"text": "More photos from our honeymoon! Someone in my last post requested some pics from our first stop: Budapest. We stayed for 3 days but could’ve stayed longer! Beautiful architecture, great food!! Highly recommend if you’re looking for a great, walkable city to explore."}
{"text": "What were some popular tourist destinations from the 80s and 90s that kind of went into oblivion?"}
{"text": "Montenegro, Kosovo, Macedonia and Albania Road Trip Nov 2020."}
{"text": "Backpacking to Laguna Cerro Castillo, Chile — Five years ago on a year long road trip"}
{"text": "A few pictures from my visit Copenhagen back in 2017"}
{"text": "Iceland in 2016: Drove the ring road and loved all of the tiny churches (plus the main cathedral in Reykjavik!)"}
{"text": "My trip to Tromsø, Norway October 2019❄️"}
{"text": "Coronavirus Megathread (Jan 2021): For travel-related discussion in the context of COVID-19"}
